[
  {
    "id": "current_bloomreaper",
    "buttonText": "🔫 Free Raid Boss : Bloomreaper the Invincible 🔫 + More<small><br>Dropped/Dropps : December 11, 2025</small>",
    "imageUrl": "https://raw.githubusercontent.com/xsmashx88x/-xsmashx88x/main/dlc/Bloomreaper%20the%20Invincible-raidboss1free.jpeg",
    "descriptionText": "<b>🆕 ICYMI : </b>Bloomreaper is a brand-new raid boss coming to Borderlands 4. Alongside it, there will also be a UVHM (Ultimate Vault Hunter Mode) increase, bringing a new challenge for players to dive into.<br><br><b>Bloomreaper :</b><ul><li><b>invincibles:</b> If you are familiar with 'invincibles' from the older games in the series, this will certainly ring a bell.</li><li><b>will be the first endgame raid boss in Borderlands 4.</b> While the name invincible may seem impossible to kill, know that they will be killable, but not easy. Here's what you can expect:<br>- Massive Health Pools<br>- Extremely Lethal Attack Damage<br>- New Modifiers</li></ul><br><b>Tips For Fighting : Bloomreaper :</b><ul><li><b>Vile:</b> Splash Damage</li><li><b>Flesh:</b> Incendairy Damage</li></ul><br><b>Drops From Bloomreaper : 5 dedicated legendary items</b><ul><li><b>Will Update:</b> Once I see whats dropping, So please give me a few : (will update with images or stat/gun links<br><li>Rainmaker - Ripper Sniper Rifle (guaranteed drop for Platinum-tier rewards in UVHM)</li><li>Mantra - Maliwan Shotgun<li>Undershield - Vladof Shield<li>Urchin - Tediore Ordnance (Grenade)<li>Jett-Setter - Ripper Ordnance (Heavy Weapon)<li>Misericorde - Siren Class Mod (can only drop for Silver-tier or higher rewards in UVHM)<li>Overdriver - Exo-Soldier Class Mod (can only drop for Silver-tier or higher rewards in UVHM)<li>Trooper - Gravitar Class Mod (can only drop for Silver-tier or higher rewards in UVHM)<li>Lamplighter - Forgeknight Class Mod (can only drop for Silver-tier or higher rewards in UVHM)</li></ul><br><b>True Mode :</b><ul><li><b>Dev Note:</b> We wanted to provide a greater challenge to players who have spent the time to perfect their mightiest builds. True Mode scales up all enemies as if you were playing in a 4-player party, regardless of your current party size. That means your opponents will be tougher to take down, far more numerous, and have more Badass elites among their ranks. True Mode is found in the Session Settings menu and works independently of Ultimate Vault Hunter Mode, allowing Vault Hunters to have the most control over their difficulty. </li><li><b>Added support for True Mode, a new difficulty that is always scaled for a party of 4 regardless of the amount of players. The change here ups that balance to provide a greater challenge to those who are ready to take it on. This new difficulty mode is available when a player has completed the campaign.</li></ul><br><b>Ultimate Vault Hunter Mode 6 It is time for a greater challenge:</b><ul><li><b></b> Added support for UVHM 6 </li><li>Added new UVHM challenge</li><li>Added new Firmware: Skillcraft, only available in UVHM 6</li></ul></li>Skillcraft tiers make your Action Skills even more dangerous to your enemies. <br><ul><li>Tier 1: Skill Damage +10%</li><li>Tier 2: Skill Critical Chance +10%</li><li>Tier 3: Dealing Skill Damage increases Skill Damage Dealt by 2% for 10 seconds. Max 25 Stacks.</li></ul> ",
    "customButtons": {}
  },
  {
    "id": "past_mercenary",
    "buttonText": "❄️How Rush Saved Mercenary Day❄️<small><br>Bounty Pack 1 | Dropped : November 20, 2025</small>",
    "imageUrl": "https://raw.githubusercontent.com/xsmashx88x/-xsmashx88x/main/dlc/BP1.png",
    "descriptionText": "<b>🆕 ICYMI : </b>Anyone who purchased the Deluxe Edition, Super Deluxe Edition, or Bounty Pack Bundle will receive a new, fifth Bounty Pack in 2026 at no additional cost.<br><br><b>Type Of Content : </b><s>Paid DLC</s> Given Free |<i>Will update as more info,images come out</i><br><br><b>Narrative content :</b><ul><li><b>Story:</b> Players help Rush organize a 'Mercenary Day' celebration on Chyros, which is opposed by Minister Screw, the holiday-hating Minister of Culture.</li><li><b>Content:</b> Includes new main missions, enemies, and legendary loot.</li></ul><br><b>Vault Card rewards :</b><ul><li><b>Vault Card:</b> A permanent, non-expiring card that provides rewards through completing daily and weekly challenges..</li><li><b>Loot: 24 cosmetics to unlock and four pieces of rerollable gear</b><br>4 re-rollable weapons<br>4 Vault Hunter Heads<br>4 Vault Hunter Skins<br>5 Weapon Skins<br>5 Vehicle Skins<br>4 ECHO-4 Drone Skins<br>2 ECHO-4 Attachments </li></ul><br><b>Other earnable content :</b><ul><li><b>DigiRunner:</b> A new vehicle for the in-game mode.</li><li><b>Vault Hunter Skin:</b> A new cosmetic skin for a Vault Hunter.</li><li><b>ECHO-4 Skin:</b> A new cosmetic skin for the ECHO-4 drone.</li></ul>",
    "customButtons": {}
  }
]
