[
          {
  "title": "Update Notes - Feb 26, 2026",
  "imageUrl": "https://assets.2k.com/1a6ngf98576c/2wivUEpKzn9Pnuj86UfAMg/b8accee5a5cb43f598a48731a6f946d0/BL4-Update-Feb26-2025.jpg",
  "details": [
    "**Bounty Pack 2: Legend of the Stone Demon**",
    "- Added support for Bounty Pack 2: Legend of the Stone Demon and the Bounty Pack 2 Vault Card",
    "- Vault Cards give more loot and XP via Daily/Weekly challenges with no time limits or expiring rewards; progression is driven by gaining XP through exploring Kairos, killing enemies, and completing quests",
    "- Included 24 new cosmetics and 4 pieces of rerollable gear: Daedalus Assault Rifle (Mercredi), Torgue Shotgun (ARC-TAN), Torgue Grenade (Countermeasure), and Ripper Sniper Rifle (Tank Buster)",
    "- New Legendary Gear Added: Maliwan SMG (Broken Wings), Vladof AR (Bubbles), Tediore Shield (Hopscotch), Jakobs Shotgun (Doeshot), Order Pistol (Roulette), Tediore AR (Laser Disker - Returning!), Vladof SMG (Mercurious), Torgue AR (Fleabag), Ripper Shotgun (Hair Trigger), and Jakobs Pistol (Shalashaska - available via Ordonite Processor)",
    "",
    "**Pearlescent Gear & Ordonite Processor**",
    "- New Rarity: Pearlescent! These rare weapons feature Ordonite Infusion, which automatically overrides elements to match an enemy's Health type for optimal damage",
    "- Dev Note: Ordonite Infusion applies based on Maliwan's active element; applies to initial Underbarrel damage only; and will not change Vex’s Phase Covenant Trait or trigger related passives",
    "- New Activity: Ordonite Processor! Activate with Eridium in Fadefields, Carcadia Burn, or Terminus Range to fight waves of enemies. Recycle Ordonite to attract corrupted enemies that drop Pearlescent gear",
    "- New Pearlescent Gear: Tediore Shotgun (Eigenburst), Maliwan Sniper Rifle (Conflux), and Torgue Pistol (Hand Cannon - requires Bounty Pack 2)",
    "",
    "**Progression and Missions**",
    "- Skill points now stay assigned when leveling up during co-op sessions to maintain combat flow",
    "- Fixed Badass Phalanx targets not appearing for Contracts near the Drill Site (Fadefields) and Smackwater (Carcadia Burn)",
    "- During 'Casting Call', Harlowe the Gravitar’s Zero-Point skill will no longer throw NPCs into unreachable areas",
    "- Map tracker now shows correct info during The War on Mercenary Day; reduced ambient volume during nighttime in Terminus Range",
    "",
    "**Vault Cards & Rewards**",
    "- Fixed issues with friends buying/using Vault Card gear and EGS-specific DLC outfit persistence",
    "- 'Kill enemies' and 'Kill Order' challenges now correctly track progress while playing in a group",
    "- Improved text and icon readability on Vault Card menus",
    "",
    "**Gear & Combat**",
    "- Adjusted Asher’s Rise balance and fixed Slow Burn Augment interaction issues",
    "- Players can now swap into DLC gear while inside a vehicle",
    "- Fixed visual effect jitter for Harlowe when using CHROMA Accelerator and Q-Ball Capstone",
    "- Corrected skill point values for the Commander (Vex) and Viking (Amon) Class Mods",
    "",
    "**Splitscreen & UI**",
    "- Fixed UI placement for banners and purchase prompts in splitscreen; main player can now stop travel countdowns; FOV settings now update for both players",
    "- Added a 'Clear Notification Pips' button in General Settings to clear all menu icons at once",
    "- Fixed UVHM menu overlaps, mouse cursor scroll bar functionality, and Photo Mode reset issues",
    "- Ongoing improvements to stability and optimization",
    "",
    "**Please restart your game to ensure that the update goes through and to prevent connection errors in matchmaking**",
    "- If you're encountering any issues, please [_contact 2K Support_](https://support.borderlands.com/hc/en-us/requests/new?ticket_form_id=32130122043795) for direct assistance. You can also read the [_PC Troubleshooting Guide_](https://support.borderlands.com/hc/en-us/articles/44493923901971-Borderlands-4-PC-Troubleshooting-and-Optimization-Guide), a list of [_known issues_](https://support.borderlands.com/hc/en-us/community/topics), or [_browse a list of Support threads here_](https://support.borderlands.com/hc/en-us/sections/39799542385299-Tech-Tinkering-Tips)",
    "- **View Them Here** https://borderlands.2k.com/borderlands-4/update-notes/"
  ]
},
          {
    "title": "Update Notes - Feb 12, 2026",
    "imageUrl": "https://assets.2k.com/1a6ngf98576c/5KPeke4KhfInHfVv6xI7NK/cd01d7227d3513b4421f54f60b73602a/BL4-Update-Jan29-2025.jpg",
  "details": [
    "**Change Notes**",
    "- Updated the Teen Witch Class Mod to award the correct amount of points in Vex the Siren’s Grave Thirst passive skill",
        "",
      "**Please restart your game to ensure that the update goes through and to prevent connection errors in matchmaking**",
      "- If you're encountering any issues, please [_contact 2K Support_](https://support.borderlands.com/hc/en-us/requests/new?ticket_form_id=32130122043795) for direct assistance. You can also read the [_PC Troubleshooting Guide_](https://support.borderlands.com/hc/en-us/articles/44493923901971-Borderlands-4-PC-Troubleshooting-and-Optimization-Guide), a list of [_known issues_](https://support.borderlands.com/hc/en-us/community/topics), or [_browse a list of Support threads here_](https://support.borderlands.com/hc/en-us/sections/39799542385299-Tech-Tinkering-Tips)",
      "- **View Them Here** https://borderlands.2k.com/borderlands-4/update-notes/"
    ]
},   
     {
    "title": "Update Notes - Feb 5, 2026",
    "imageUrl": "https://assets.2k.com/1a6ngf98576c/5KPeke4KhfInHfVv6xI7NK/cd01d7227d3513b4421f54f60b73602a/BL4-Update-Jan29-2025.jpg",
  "details": [
    "**Change Notes**",
    "- Increased the dedicated drop rate for Weekly Big Encore Boss fights. This does not scale with Ultimate Vault Hunter (UVH) mode.",
    "- Increased Phosophene drop rate for Bloomreaper",
    "- Addressed a reported issue causing Bloomreaper's Phosphene drop rates to not scale properly with UVH",
          "- Ensured that the Primordial Vault: Carcadia Burn boss' drop rates scale properly with UVH",
          "- Added Weekly Big Encore Boss drop rates to the Rippa Roadbirds boss fight",
      "",
      "**Please restart your game to ensure that the update goes through and to prevent connection errors in matchmaking**",
      "- If you're encountering any issues, please [_contact 2K Support_](https://support.borderlands.com/hc/en-us/requests/new?ticket_form_id=32130122043795) for direct assistance. You can also read the [_PC Troubleshooting Guide_](https://support.borderlands.com/hc/en-us/articles/44493923901971-Borderlands-4-PC-Troubleshooting-and-Optimization-Guide), a list of [_known issues_](https://support.borderlands.com/hc/en-us/community/topics), or [_browse a list of Support threads here_](https://support.borderlands.com/hc/en-us/sections/39799542385299-Tech-Tinkering-Tips)",
      "- **View Them Here** https://borderlands.2k.com/borderlands-4/update-notes/"
    ]
},   
    {
    "title": "Update Notes - January 29, 2026",
    "imageUrl": "https://assets.2k.com/1a6ngf98576c/5KPeke4KhfInHfVv6xI7NK/cd01d7227d3513b4421f54f60b73602a/BL4-Update-Jan29-2025.jpg",
  "details": [
    "**New Content: Photo Mode**",
    "- Photo Mode is now available to all Borderlands 4 players, so you can capture mayhem-fueled moments or serene shots of Kairos' scenic beauty to share with your fellow Vault Hunters! Check out the [Borderlands 4 Photo Mode guide](https://borderlands.2k.com/en-GB/borderlands-4/news/photo-mode/) for full details! You can access Photo Mode via the Pause Menu during gameplay.<br>While Photo Mode is active, you can adjust the position of the camera using the standard movement controls. The Photo Mode UI has multiple tabs with a wide range of settings with different visual effects. In single-player, going into Photo Mode will pause all the action by default, so you can freely dial in your ideal shot without missing the perfect moment!<br>Please note that Photo Mode is only available during gameplay, and cannot be accessed during cutscenes. It's also not available in splitscreen play on consoles.",
    "- Get the perfect shot by adjusting the Field of View, Depth of Field, camera angles, and various visual filters",
    "- Change the time of day or toggle the visibility of Player Characters, Summons, NPCs, Enemies, and even Damage Numbers to clear the frame",
    "",
    "**Progression and Rewards**",
    "- Patrol: Order troops: Now progresses when killing enemies",
    "- Trace: Scrap Core: The scrap core object is able to be interacted with consistently and the contract from Dominion can now be completed",
    "- Convinced the Intrusive Thoughts Vile Ripper, Deep State Phalanx, and Breaux Chambeaux Phalanx bounties to show up when a player has taken their contracts",
    "- “Loot or Purchase 10/15 legendaries” Vault Card weekly challenge will no longer reset with a save/load",
    "- “Loot or Purchase Ordnance” will now increase when conditions are met",
    "- “Kill enemies with Torgue guns and gear” will now progress when using Torgue legendary grenade Firepot",
    "- “Kill X enemies with Maliwan guns and gears” and the Maliwan Challenge “Last Wan Standing” will now progress as intended",
    "- Legendary Forsaken Chaos and Legendary Midnight Defiance have been removed from the Collect All Phosphene Challenge",
    "- Updated Maliwan status effects to better identify what triggered the status effects, leading to better tracking on challenges",
    "- Addressed a reported issue that was causing travel to Dominion to be locked by a player leaving a transition area in multiplayer",
    "- “Potty Mouth” Mission: Objectives are no longer blocked when exiting to the main menu",
    "- Addressed an issue causing unlocked DLC content to be unavailable while offline",
    "- True Mode is now able to be consistently enabled for newly created level 30 UVHM characters",
    "- Added a tutorial for True Mode when the campaign is completed",
    "- Players creating a new character in multiplayer will now receive all intended rewards",
    "- Addressed a reported issue causing all equipment to be lost when quitting to the main menu during a countdown in multiplayer when switching to solo play",
    "- Addressed issues with the “Gourd Your Loins” cosmetic reward not being awarded with SHiFT code",
    "- **SHiFT Code: THFB3-R9XKK-CFBJW-T33BB-9R3CC**<br>Redeem this code to get the 'Gourd Your Loins' Vault Hunter Head and the 'Hex Appeal' Weapon Skin! Must redeem by December 31, 2030.",
    "",
    "**Vault Hunters**",
    "- Addressed reported issues where critical hit damage sometimes wasn't being applied to critical hits",
    "**Specializations**",
    "- Daredevil: Action Skill Cooldown rate has been adjusted to .5% and a multiplicative Action Skill Damage bonus has been added",
    "- Runner: Melee Damage bonus is now a multiplicative instead of additive",
    "**Harlowe the Gravitar Skill Rework**",
    "- **Dev Note:** We’re making several changes to Zero-Point as another step towards making this skill tree feel more satisfying and better balanced relative to Harlowe’s other trees. Because we're changing the fundamental behavior of Zero-Point to include the old Inertia Augment behavior in the base skill, we want to see how these changes balance out before doing more work in the rest of the tree.",
    "- Zero-Point (Base Skill): Now includes the benefits of the previous 'Inertia' Augment. Killing an enemy in Stasis now resets the duration, searches for a new target, and makes the duration decrease faster",
    "- Inertia Augment (Changed): Updated to increase Harlowe’s Slam Damage. Whenever she slams an enemy, create Mini Unstable Energy Pocket projectiles that randomly deal Cryo or Radiation damage. Additionally, she also gains increased Status Effect Damage and Status Effect Chance. This effect stacks.",
    "**Amon the Forgeknight**",
    "- Amon now consistently deals bonus Cryo Damage when equipping Cryonic Thrum Augment in multiplayer",
    "- Prevented unintended increases in the number of segments in the Vault Hunter bar when Amon activates his Action Skill",
    "- Dragon’s Breath now applies properly to Ripper Heavy Weapons with beams",
    "- Firewall Forgeskill will now block Moon-Maddened Callis projectile attacks",
    "**Vex the Siren**",
    "- Addressed the cooldown for Prismatic Ichors sometimes resetting when applying a status effect",
    "- Phase Pocket Passive no longer resets the Taser underbarrel magazine when using a Vladof Enhancement",
    "- Healing numbers now present correctly when Specters are using Ripper Legendary Sniper Rifle Tankbuster",
    "- Addressed Incarnate Action Skill behavior so that it continues to work while using the Vibe Check Capstone with the Legendary Class Mod Technomancer",
    "",
    "**General Gameplay**",
    "**Bloomreaper Boss Fight**",
    "- Falling into the fog will now consistently kill players instead of having them fall out of the map",
    "- The purple rift will now only appear after the boss is defeated",
    "- Addressed an instance of Bloomreaper keeping the Invincible health bar in the second phase",
    "- Addressed an exploit that would allow UVHM time trial rewards to be obtained while not in UVHM",
    "- Addressed an issue that would cause the chest for Platinum rewards to be empty after fulfilling the requirements",
    "- Disc-shooting heavy weapons will now damage Bloomreaper’s crystals",
    "- Vile Creeps should no longer get stuck in the air",
    "**World Events and Bosses**",
    "- Increased the spawn rate of world bosses in the Punitive Manufactorium area",
    "- Rewards will now reliably spawn when completing the Airship or The Goredello world events",
    "- Minister Screw is no longer able to be frozen",
    "- Toy Pinheads are now affected by singularity grenades",
    "- Idolator Sol now takes damage from Elemental Hazards created by skills while Bio Armor is broken",
    "- Vile Lictor’s limbs will now continue to respawn after freezing them",
    "- Gennifer will now remain inside the refugee even if the player is dying near the area",
    "- Lowered the amount of Badass enemies spawning in one spot by Electi Safe Collectable",
    "- Ensured that boss fights consistently reset when all players have died",
    "- Restored the ability to interact with Fortresses if travel was canceled by leaving a transition area in multiplayer",
    "**Loot and Stations**",
    "- UVH levels now increase dedicated loot drop levels. The higher the level, the higher the chance of dedicated loot dropping!",
    "- Changed the Respawn Station outside of Umbral Foundry to a Fast Travel station to allow for easier travel to the entrance",
    "- Prevented loot items from dropping into unintended areas after defeating The Oppressor or killing all enemies in Ripper Drill Site Saw’s Clench",
    "- Red Chest in Coastal Bonescape will only unlock when all enemies are killed",
    "**Mission, Enemy and ECHO Location Updates**",
    "- Guns Blazing: Arjay will now consistently engage in combat against enemies",
    "- The Power Ballad of Rodd Vomit: Addressed enemy pathing to reach the player",
    "- Missions will no longer progress unexpectedly in multiplayer when switching from splitscreen to solo play",
    "- Radioactive Rail Liner will now attack if players are close to it",
    "- ECHO Location guidance improvements",
    "- Rift Champion icon removed from the Compass, with cleaned-up functionality for those icons in the Map",
    "",
    "**Guns & Gear**",
    "- **Enhancement**: Adjusted the Underdog enhancement to only apply to Vladof underbarrel weapons. Wombo Combo rockets now correctly count as underbarrel damage",
    "- **Tediore**: Legendary AR Chuck now throws properly at high reload speeds; fixed homing on the third gun spawned; removed extra gun from shotguns with Ripper magazines",
    "- **Maliwan**: Legendary SMG Ohm I Got no longer consumes Energy Shield when Overshield is active; Status Effect spread fixed for Maliwan-licensed parts; fixed Singularities on Sniper Rifles",
    "- **Jakobs**: Addressed ricochet damage to apply the intended amount of damage",
    "- **Torgue**: Legendary Pistol Hardpoint fires as intended with Tediore licensed-parts; Shield Compleation now properly triggers Segment Break augments",
    "- **Order**: Legendary Sniper Rooker projectiles home consistently; fixed unintended underbarrel projectiles with Jakobs licensed parts",
    "- **Ripper**: Legendary Shield Watts 4 Dinner now consistently gives overshield in multiplayer; Daedalus SMGs inherit Ripper magazine charge-up time",
    "- **CoV**: Weapons with CoV magazines now continue to fire when using Bullets to Spare firmware level 3",
    "- **Atlas**: Fixed Sure Shot perk triggering on Rafa Peacebreaker Cannons; updated Tracker Antenna and Trauma Bond to apply only to Atlas-licensed gear",
    "- **Ordnance**: Heavy Weapons now cause damage to BoomBoom Drones during the Callis boss fight",
    "- **Firmware**: Skillcraft receives proper stacks; Deadeye 2-piece and High Caliber 3-piece bonuses now function as intended; Get Throwin’ increases Heavy Weapon damage",
    "**Visual, Audio, and Animation updates**",
    "- Restored prefixes to Tediore Legendary Grenade UAV",
    "- Order Legendary Pistol Bully with Hyperion Shield enhancement now displays all parts on the item card",
    "- Repkit will no longer disappear when trying to heal after climbing",
    "- Corrected animations for Daedalus SMGs with Atlas Underbarrel attachments",
    "- Corrected audio on the Daedalus Legendary Shotgun Missilaser",
    "- Maliwan Legendary Shotgun Mantra now shows the Amara Phase Fist when fired",
    "- Adjusted reload animation for Ripper Shotguns with CoV magazines",
    "- Adjusted Ripper effects when shooting Ripper guns with Maliwan-licensed underbarrel parts",
    "",
    "**Audio & Visuals**",
    "- Vault Hunter voices return to normal after unequipping Kittycopter head",
    "- Marcus now talks at the proper time; Goredello round 2 now announces enemy types",
    "- Corrected ECHO-4 appearance with ECHO-IVIV frame and Nurple paintjob",
    "- Ensured Vex the Siren's tattoos glow as intended with all skins",
    "- Melee animations for Rafa the Exo-Soldier play correctly in multiplayer",
    "- Resolved climbing animations not syncing in multiplayer",
    "- Adjusted brightness of Seeker Witness’ laser effects and removed damage numbers from Arjay post-fight",
    "- Addressed clipping, missing collision, out-of-bounds access, and stuck spots in various areas",
    "- Trees inside buildings no longer blow in the wind; Fire no longer pops near Dominion",
    "",
    "**UI, Text, Localization**",
    "- Sorting in Customization Menu now defaults to show Unlocked Customizations first",
    "- Corrected issue causing Backpack to appear empty after filtering",
    "- Addressed Vault Card progress resetting or disappearing after disconnects in multiplayer",
    "- Updated localization, text descriptions, subtitle timings, and icon visibility",
    "**Splitscreen**",
    "- 'Flip Card' functionality restored after level transitions; corrected scrolling in Vault Cards menu",
    "- Golden Chest no longer gets stuck with 'Transaction in Progress' if a secondary player leaves",
    "- Both players now see all mission items during 'Breeding Daisies'",
    "- Adjusted nameplate text sizes and UI elements to prevent overlapping",
    "**Player Experience**",
    "- [Console Only] Several instances of incorrect gear meshes have been corrected",
    "- [PC Only] Adjusted default mouse sensitivity and added option to disable mouse smoothing",
    "- Blended facial animations for better optimization; visual optimizations for Jakobs Legendary Shotgun Rainbow Vomit",
    "- Various stability and optimization improvements across all platforms",
    "",
    "**Please restart your game to ensure that the update goes through and to prevent connection errors in matchmaking**",
    "- If you're encountering any issues, please [_contact 2K Support_](https://support.borderlands.com/hc/en-us/requests/new?ticket_form_id=32130122043795) for direct assistance. You can also read the [_PC Troubleshooting Guide_](https://support.borderlands.com/hc/en-us/articles/44493923901971-Borderlands-4-PC-Troubleshooting-and-Optimization-Guide), a list of [_known issues_](https://support.borderlands.com/hc/en-us/community/topics), or [_browse a list of Support threads here_](https://support.borderlands.com/hc/en-us/sections/39799542385299-Tech-Tinkering-Tips)",
    "- **View Them Here** https://borderlands.2k.com/borderlands-4/update-notes/"
    ]
},
{
    "title": "Minor Update Notes - December 18, 2025",
    "imageUrl": "https://assets.2k.com/1a6ngf98576c/574NnvobXleucMvFjj19g6/b8c8116e6c7e5a841ad486f72085c36a/BL4_Weekly_Activity_12-18.jpg",
    "details": [
      "**A Message from the Team**",
      "- As we head into the holidays, we want to extend our gratitude to everyone playing Borderlands 4; this community is beyond badass, and we're endlessly appreciative of your passion and feedback. We're stoked to bring you even more mayhem in 2026!",
      "",
      "**Weekly Activities: Triple Threat**",
      "- To close out 2025, we're mixing things up with a Triple Threat of Big Encore Bosses and a Season's Lootings increase to Legendary drop rates for bosses!",
      "- Starting today, this Triple Threat will feature THREE True Bosses at once while our team logs off to celebrate Mercenary Day with our loved ones.",
      "- We'll resume a weekly rotation of bosses with our Minor Update on January 8, 2026!",
      "- This Minor Update covers Weekly Activities from December 18, 2025 to January 8, 2026 while we take time off for some holiday R&R. There will be no change to Weekly Activities on January 1, 2026.",
      "",
      "**Season's Lootings**",
      "- During Season's Lootings you'll be up to 5x more likely to get a Legendary drop (outside of Big Encore Bosses and Bloomreaper) as you grind for loot while this effect is live, also until January 8!",
      "- Legendary loot drops will still be infrequent enough to feel special, in keeping with our overall design intent.",
      "",
      "**2026 Roadmap**",
      "- We're hard at work on your 2026 content, including new Bounty Packs, your first Story Pack, and a Takedown!",
      "",
      "**COMMUNITY SURVEY: SHAPE THE FUTURE**",
      "- While we work on these longer-lead projects though, we want to know what weekly endgame activities you want to see more (or less!) of.",
      "- **Take our survey here, and help us shape your weekly rotations in 2026!**",
      "- [_Click here to take the Borderlands 4 Community Survey_](https://s.alchemer.com/s3/Borderlands-4-Community-Survey-Weekly-Endgame-Activities)",
      "",
      "**Please restart your game to ensure that the update goes through and to prevent connection errors in matchmaking**",
      "- If you're encountering any issues, please [_contact 2K Support_](https://support.borderlands.com/hc/en-us/requests/new?ticket_form_id=32130122043795) for direct assistance. You can also read the [_PC Troubleshooting Guide_](https://support.borderlands.com/hc/en-us/articles/44493923901971-Borderlands-4-PC-Troubleshooting-and-Optimization-Guide), a list of [_known issues_](https://support.borderlands.com/hc/en-us/community/topics), or [_browse a list of Support threads here_](https://support.borderlands.com/hc/en-us/sections/39799542385299-Tech-Tinkering-Tips)",
      "- **View Them Here** https://borderlands.2k.com/borderlands-4/update-notes/"
    ]
},
  {
    "title": "Update Notes - December 11, 2025",
    "imageUrl": "https://assets.2k.com/1a6ngf98576c/QeprEWljAkfYkgbMAqadY/7f3a099dcda516e0df38af1b32eb5b7e/BL4-Update-Dec11-2025__1_.jpg",
    "details": [
      "**Gameplay**",
      "- The-Not-So-Immortal Boneface is no longer immortal due to an unintended regeneration boost during _The Old Scrape_",
      "- Improved mission flow in _Abduction Injunction_ so the “Kill Order Captors” step continues instead of failing to progress if enemies did not appear",
      "- Bandit bounties now appear correctly in the Fade District",
      "- Lost Loot now keeps SDU upgrades after a Save/Load",
      "- Buying items in vending machines is now more reliable",
      "- Backpack Upgrade SDUs no longer reset after opening a vending machine",
      "- Mimicron fight no longer continues running after a player fast travels out of the arena during multiplayer",
      "- Axemaul now attacks players normally when fighting from the Big Encore Machine",
      "- The _Kratchman_ now continues chasing players, even if they’re on top of a box",
      "- Destroyed Generators no longer affect aim assist during _A Lot to Process_",
      "- “Kill enemies with Maliwan guns and gear” now progresses correctly when using the _Converging Kickballer_",
      "- Vault Card challenge “Kill enemies with Vladof guns and gear” now counts kills from Midnight Defiance’s additional projectiles",
      "- “Adjust for Coriolis” Sniper Rifle challenge now tracks kills from more than 50 meters away",
      "- Maliwan elemental challenges now give the correct amount of progress and no longer grant double credit for applying elemental states",
      "- Daily and weekly Vault Card challenges now refresh properly when they expire",
      "- Removed Phosphene challenges from Legendaries that were not meant to have them (Sweet Embrace and Cold Shoulder)",
      "- The “Search for Hints [0/5]” objective in No-Escape Room now completes correctly even if hints were found early",
      "- Improved digistruct tunnel transitions so players don’t get stuck after dashing into portals",
      "- Updated ECHO Location guidance in several missions such that the path appears consistently and points the player in the right direction",
      "",
      "**Gear**",
      "- Dev Note: We are aware of a reported issue causing Vault Card progress to be lost in multiplayer. We’re currently tracking and will provide updates on the [__Borderlands___ Support Website Issue Tracker_](https://support.borderlands.com/hc/en-us/community/topics/43238641357075-Borderlands-4-Live-Issues) when we have them.",
      "- Reduced how far the Repulsor Augment could launch enemies, as it could cause mission blockers",
      "- Vehicle rockets and missiles no longer launch enemies long distances",
      "- Updated Vladof Legendary Midnight Defiance Sniper Rifle with the Jakobs licensed part to more reliably ricochet projectiles on critical hits",
      "- Level 3 Bullets to Spare Firmware now works correctly with COV magazines",
      "- Maliwan Sniper Rifles with Singularity Grenade Launcher underbarrels have been corrected to impact enemies rather than passing through them",
      "- The Tediore Legendary Pistol Budget Deity no longer shows unintended homing behavior",
      "- Tediore Legendary Pistol Inscriber now counts the Timekeeper’s Radiant Shield correctly to prevent extra projectiles spawning",
      "- Torgue sticky projectiles now explode after auto-reloading the Tediore Legendary Anarchy Shotgun when transitioning between areas",
      "- The Order Legendary Rooker Sniper Rifle now plays proper airborne SFX while in flight",
      "- Bullet impact decals now fade as normally instead of staying “hot” indefinitely",
      "- VFX for the Daedalus Legendary Missilaser now appear instantly when fired",
      "- Torgue Legendary Shield Firewerks missiles now spawn more reliably after defeating enemies",
      "- Nova damage has been adjusted to increase as intended from stacks of Resolve from the Order Legendary Shield Cindershelly",
      "- Prevented the Legendary Shield Super Soldier from regenerating Heavy Ordnance charges with the Power Play passive",
      "- Elemental attribute details on gear cards now display as intended when comparing gear of the same element",
      "- Updated Ripper Legendary Hellfire SMG to correctly apply its intended damage increase",
      "- Order Legendary Rooker Sniper Rifle now spawns the correct amount of needles",
      "- Vault Card challenge “Loot or Purchase 5 Ordnance” will now increase progress as intended with Heavy Weapons",
      "- Updated the Vault Card Weekly Challenge “Loot or Purchase 10/15 Legendaries” to persist when save/loading",
      "",
      "**Vault Hunters**",
      "- Prevented an exploit that unlocked Vault Hunter skills earlier than intended",
      "- New characters no longer inherit SDU points from previous characters",
      "- Amon and Rafa’s elemental stats now show the correct values when skipping the prologue",
      "- Shield Boi from the Tediore Legendary Principal has been updated to allow Rafa Aphophis Lance skill and Vex Incarnate skill to fire through it normally",
      "",
      "**Trouble, Reapers, and Forge Weapon Changes**",
      "- Dev Note: Companions aren’t quite hitting the benchmark that we would like them to be performing at, so we’re starting with making them more reliable in a variety of ways. We’ll be keeping an eye on how various summons are performing and make more adjustments as necessary.",
      "- Trouble now has a \"Blink Melee Attack\" that will occur every 12 seconds if too far from the target, causing them to immediately teleport and attack. This should make Trouble much more responsive in the heat of combat",
      "- Trouble, Reapers, and Forge Weapons have also gained increased Damage Radius to make them reliably damage enemies",
      "",
      "**Amon**",
      "- Tempered Pyre deals ~20% more damage",
      "- Tempered Ice deals ~23% more damage",
      "- Tempered Lightning deals ~13% more damage",
      "",
      "**Harlowe**",
      "- Updated Harlowe’s _Potential Transference_ Capstone to allow the Adrenaline Pump Repkit to trigger as intended when Second Wind is earned in multiplayer sessions",
      "",
      "**Rafa**",
      "- Updated “Per My Last” to prevent it from unintentionally behaving as an Overdrive skill",
      "- The Daedalus Legendary Rogue Luty Madlad SMG now interacts properly with the Exo-Soldier Action Skill _APOPHIS Lance_. Previously, the weapon could stop consuming ammo and firing despite showing the firing animation",
      "",
      "**Vex**",
      "- Troubles ranged attacks now also benefit from Melee Damage",
      "- Blink Strike deals ~14% more damage",
      "- Violent Outburst deals ~11% more damage",
      "- Hexus Nexus deals ~14% more damage",
      "",
      "**Splitscreen Improvements**",
      "- Improved several splitscreen UI elements, including ECHO Log readability and news article sizing",
      "- Enhanced Vault Card usability in splitscreen",
      "- Splitscreen settings now persist after closing the game",
      "- Improved instructions for reconnecting to online play",
      "- Travel countdown notifications now show consistently for all splitscreen players",
      "",
      "**Visual/Audio Changes**",
      "- Reduced cases where the screen distorts before cinematics begin",
      "- Character animations now switch correctly between ladder climbing and swimming in Belton’s Bore",
      "- Oddman’s body no longer appears after replaying _Exit Through the Rift Shop_ with a different choice",
      "- Adjusted animations for enemies holding various weapons",
      "- Updated various incorrect, missing, or low-resolution models and textures",
      "- Corrected background display when using the Black Market Vending Machine in Carcadia Burn",
      "- Updated areas where loot could get stuck, including Bramblesong and the final ramp in How Rush Saved Mercenary Day",
      "- Updated multiple locations where collision, clipping, or out-of-bounds paths could occur",
      "- Two non-functional ECHO Logs no longer appear after completing _The Weird Way Home_",
      "- Enemies no longer disappear behind the metal door during Genone’s fight in _The Yawning Yard_",
      "- Ensured doors in How Rush Saved Mercenary Day display with correct green lights when unlocked",
      "- Improved visuals for Amon’s VH-2015 body customization so there are no visible gaps when viewed by other players in multiplayer",
      "- Vault Card ticket amounts now refresh properly after the first purchase",
      "- Updated various audio behaviors",
      "- Updated how combat music reevaluates critical threats properly when entering fresh combat",
      "",
      "**UI/Text**",
      "- “Buy” and “Buyback” tabs in Vending IO now display the correct, different items",
      "- Item Cards in vending machines no longer compare to unknown items",
      "- Item level and value information now always show when comparing items in vending screens",
      "- Improved stability and display consistency across all Vending Machine menus",
      "- Added tooltips to the skills on Class Mods in Item Inspect to show what each skill does",
      "- Improved weapon wheel speed and hold sensitivity",
      "- Locked SHiFT rewards are now hidden in customization menus",
      "- Improvements to ECHO Logs include functional sort buttons, dropdowns that close naturally, clear selection highlighting, and sort/filter preferences that persist between when leaving and re-entering the menu",
      "- Key prompts now function correctly when switching widgets inside the News section of the pause menu",
      "- The “Flip Card” prompt now appears consistently across item comparison menu",
      "- Corrected some cases preventing the prompt to send loot to the bank to now appear and be functional in the Inventory menu",
      "- Improved Vault Card visual consistency",
      "- Updated various UI visuals and icons for alignment, consistency, and clarity",
      "- Updated localization, various text descriptions, subtitle timings, and text alignment across the game",
      "- Updated Credits",
      "",
      "**Player Experience Improvements**",
      "- Reduced a reported rare black-screen situation on Xbox Series X|S and PS5 after the vault loading screen",
      "- Improved framerate when using a Torgue Shotgun with the Flameblast underbarrel",
      "- Minor Update download now stops correctly when signing out during the download",
      "- Titles with Windows usernames containing special characters now restart correctly after installing a Minor Update",
      "",
      "**A note from the dev team:**",
      "- Over the past few months, the team has been investigating how to deliver the best runtime performance possible with _Borderlands 4_. Since launching, we've discovered a number of fixes that deliver noticeable framerate boosts and reduce stuttering without making sacrifices in visual quality. Some of the fixes are improvements to our code or content; other fixes come from later versions of Epic's Unreal Engine. See below for more details.",
      "- However, we still have much more to do here. We're in this for the long haul, and over the coming months we'll roll out even more performance improvements. We appreciate the community's feedback, and your patience!",
      "- Improved the performance cost of many UI elements (menus, HUD, and overlays) without lowering visual quality",
      "- The game now uses Profile-Guided Optimization (PGO), which allows the executable to run more efficiently and brings large CPU performance gains",
      "- Encouraged smoother gameplay by reducing gameplay hitches caused by shader and PSO (Pipeline State Object) compilation",
      "- Optimized grass, shrubs, and other foliage by updating their meshes and materials, reducing the cost of drawing them on screen",
      "- Added several GPU optimizations pulled in from newer versions of Unreal Engine",
      "- Improved the performance of the Lumen lighting system",
      "- Improved the performance of foliage reflections and water",
      "- Additional performance improvements for minimum-spec PCs in areas with grass, dynamic shadows, and wind effects",
      "- In-engine cinematics now run at higher framerates, instead of being capped at 30 FPS",
      "- Adjusted AI/NPC spawn counts in certain areas so enemies and NPCs no longer spawn in higher numbers than intended, improving both performance and gameplay flow",
      "- Removal of unnecessary extra lights, especially lights used for supporting volumetric clouds.",
      "- Improvements to Physics and Niagara to reduce memory leaks and Out-of-Memory crashes",
      "- Improvements to Cloth initialization to reduce load and spawn cost time.",
      "- Added new graphics options that lets players turn off shadows, volumetric clouds, and fog, offering better performance flexibility",
      "- Improved how VRAM is used by reorganizing texture and mesh memory pools, allowing the game to keep better visual quality at lower graphics settings without hurting performance",
      "- General stability improvements",
      "",
      "**Please restart your game to ensure that the update goes through and to prevent connection errors in matchmaking**",
      "- If you're encountering any issues, please [_contact 2K Support_](https://support.borderlands.com/hc/en-us/requests/new?ticket_form_id=32130122043795) for direct assistance. You can also read the [_PC Troubleshooting Guide_](https://support.borderlands.com/hc/en-us/articles/44493923901971-Borderlands-4-PC-Troubleshooting-and-Optimization-Guide), a list of [_known issues_](https://support.borderlands.com/hc/en-us/community/topics), or [_browse a list of Support threads here_](https://support.borderlands.com/hc/en-us/sections/39799542385299-Tech-Tinkering-Tips)",
      "- **View Them Here** https://borderlands.2k.com/borderlands-4/update-notes/"
    ]
  },
  {
    "title": "Update Notes - November 20, 2025",
    "imageUrl": "",
    "details": [
      "**Notable Changes : We wanted to pull these out specifically as they have been heavily mentioned in the community.**",
      "- Updated the Weekly Wildcard Missions to set additional start points in missions",
      "- Dev Note: This feature will allow future Weekly Wildcard Missions to jump straight to the meat of a mission.",
      "- Class Mods have been adjusted to drop more for your current character",
      "- Converted the Phosphene weapon challenge from character-based to profile-wide progression<br>○ Dev Note: This long-term grind is aimed at our most dedicated community members who invest the most time in the game. Still, we agree that completing this collection is more a reflection of your dedication to the game and not to a specific Vault Hunter. This is the first example of allowing more progression to be shared between all characters on your account.",
      "- Updated the loot feed to display total current currency after spending or receiving money",
      "- Reduced the likelihood of unintended movements or knockbacks while reviving a teammate<br>○ Dev Note: When reviving another player, the reviving player is temporarily given more mass, making enemy attacks less likely to bounce you away from your partner.",
      "- Added a new Legendary Loot Indicator to the combat radar for easier identification of high-rarity drops",
      "",
      "**Gameplay & Mission Progression**",
      "- Addressed an issue that could cause the loss of SDU Tokens or Specialization points; this also returns missing tokens and points to those impacted",
      "- Resolved an interaction where players could not repurchase a boss encounter after all party members were defeated and respawned in multiplayer",
      "- Slide-attacking lootable objects will now open or break them consistently",
      "- Resolved progression blockers for more intuitive gameplay during _Faction Survivalist_, _Wayward Gun_, _Another Day, Another Universe_, the Badass Phalanx bounty, and the Black Market Tutorial",
      "- Corrected behavior where mission items could disappear after replaying and exiting a mission, preventing completion",
      "- Prevented rare instances of some enemies turning into NPCs and becoming unkillable",
      "- Adjusted tracking on some challenges and achievements to award progress as intended<br>○ Dev Note: _The Professional_ now only awards progress for designated challenge conditions, while _Private Reserve_ and _What Have We Here?_ will progress correctly when opening chests with melee attacks. The _Arena Grande_ achievement should consistently unlock in multiplayer.",
      "- Mort will revive players more consistently during _Thresher Rancher_",
      "- Resolved a condition where vehicles could be instantly destroyed if summoned immediately after using a Repkit with the Splat trait",
      "- Adjusted object placement and pathing across multiple missions, ensuring proper enemy spawns, interactions, Echolocation, and waypoint alignment",
      "- Synchronized some mismatched animations and behaviors in multiplayer",
      "- Resolved a reported issue where players could become briefly suspended in midair when exiting mission replay while jumping or swimming",
      "- Addressed a bug causing the Chopper vehicles to remain in a falling state after performing a vertical jump or powerslide",
      "- Prevented vehicle summoning in restricted indoor areas such as the Umbral Foundry Fortress",
      "- Removed the penalty during _Scoundrel Roundup: Kilo_ if the panel is shot twice",
      "- Updated Mimicron’s combat behavior so it can no longer be stun-locked by singularity effects in the Tipping Point Bunker",
      "- Updated Patrol Ripper contract to progress with intended sources",
      "- Updated the Order Bunker boss Fractis encounter to ensure the boss remains defeatable after entering its shielded phase in The Crawlfort",
      "- Adjusted behavior in _The Next Quest Thing_ so the mission can consistently be accepted after saving and reloading",
      "- Improved enemy physics in _Gone Are My Leggies_ to prevent The Beastie from being launched out of the playable area when hit with high-impact weapons",
      "- Restored ECHO Log rewards for completing optional objectives in three micro-missions when played solo",
      "- Adjusted Arjay’s resistances so status effect damage-over-time now applies correctly<br>○ Dev Note: Visual inconsistencies with Arjay’s wings might appear as a result of this change, but will not impact gameplay.",
      "- Adjusted arena boundaries so Locust’s gas canisters now spawn correctly within the arena during the Idolator Sol encounter in Fortress Indomita",
      "",
      "**Vault Hunters**",
      "**Amon, the Forgeknight**",
      "- Updated Forgeknight Forgedrone challenge so it unlocks properly upon meeting completion requirements",
      "- Corrected skill tree investment functionality to prevent Forgeknight from applying skill points out of order",
      "- Updated weapon input handling so Forgeknight can reliably swap weapons after using the whip attack",
      "",
      "**Rafa, the Exo-Soldier**",
      "- Exo-Soldier's **Soltado** Kill Skill passive has been adjusted to function properly with two skill points",
      "- Improved **PROJECT: Raiju** capstone behavior so APOPHIS Lance consistently damages enemies during extended uptime",
      "- Adjusted **Booming Business** passive's functionality to prevent grenade spawns when the passive skill exceeds its intended level cap",
      "- Updated the **Temerario** passive skill so it provides the intended gun damage bonus rather than a general damage increase",
      "",
      "**Vex, the Siren**",
      "- Updated challenge tracking so the **Target Prescience** passive only progresses when damaging valid targets",
      "",
      "**Harlowe, the Gravitar**",
      "- Ensured that **QED** passive skill would remain functional in multiplayer",
      "- Updated Gravitar’s **Zero-Point** Action Skill so it now properly enters cooldown when used on enemies immune to Stasis. Previously, using the skill on a Stasis-immune target after affecting a normal enemy could cause it to remain active instead of triggering cooldown",
      "",
      "**All Vault Hunters**",
      "- Adjusted critical hit calculations so gun and enhancement damage now applies correctly to all valid hit regions",
      "- Adjusted Cryo resistance scaling so enemy resistances now correctly match each player’s level in multiplayer sessions",
      "- Prevented Action Skills from activating during the first loading screen before entering active gameplay",
      "- Updated kill volume logic to ensure Vault Hunters cannot cheat death while in FFYL and healing with the Legendary Shield _Guardian Angel_",
      "- Ensured sniper ammo displays full capacity when creating a level 30 Vault Hunter",
      "",
      "**Gear and Rewards**",
      "- Adjusted melee damage on Bayonet weapons so that melee damage increases with bayonet parts",
      "- Updated beam weapon behavior so they will deal proper damage when thrown",
      "- Addressed an interaction allowing players to infinitely scale the splash radius of homing sticky projectiles when using Torgue Legendary Pistol _Queen’s Rest_ with certain builds and firmware combinations",
      "- Updated _Skully_ grenade to adjust projectile damage for consistent output",
      "- Corrected boss health bar updates so sustained heavy Ordnance damage with Amon now displays correctly",
      "- Updated Torgue Heavy Weapon _Ravenfire_ so it now correctly applies elemental damage when equipped with elemental parts",
      "- Adjusted Maliwan Heavy Weapon behavior so projectiles created from a hit don't detonate immediately after spawning",
      "- Corrected the explosion delay of _Fuel Rod Discharge_ to match its description of 3 seconds when used on Ripper shotguns",
      "- Adjusted Rolling Thunder underbarrel grenades on Torgue shotguns to behave predictably on vertical surfaces instead of ricocheting excessively",
      "- Prevented bosses from floating when Exo-Soldier's **Booming Business** passive skill was triggered with Order Legendary Grenade _Skully_",
      "- Addressed a condition where the Vladof Legendary Shield _Heavyweight_ could lose functionality after activating Forgeknight **Onslaughter** skill",
      "- Adjusted projectile interaction during the fight with Vile Ripper so players can now destroy the homing “Unstable Ore” projectiles",
      "- Updated collision behavior so Jakobs Throwing Knife grenades correctly impact the orb surrounding Vile Ordonite of Corrupted enemies",
      "- Adjusted some gear that was behaving inconsistently in multiplayer, such as: the bounce-back force of The Order Legendary pistol _Noisy Cricket_, reload animation timing for the Jakobs shotgun _Hot Slugger_, and misaligned accuracy of the Daedalus pistol _Bonn-91_",
      "- Standardized some instances of Firmware 3-piece bonus cooldowns to appear consistently. Visual cooldowns have been added for Oscar Mike, Ahoy, and Daed-dy O’",
      "- Drops are no longer kept in the air when lowering the platform in _All Charged Up_",
      "- Restored functionality allowing players to loot and preview weapons from red chests after completing the Blacklime Bunker",
      "",
      "**Gear Balance:**",
      "**Darkbeast**",
      "- Addressed a scaling issue",
      "- Explosion Chance increased from 5% to 20%",
      "- Damage increased by 15%",
      "",
      "**Prince Harming**",
      "- Addressed a scaling issue",
      "- Self Damage amount reduced from 5% to 1.5% of damage done",
      "- Damage increased by ~24%",
      "",
      "**Onslaught:**",
      "- Damage increased by 75%",
      "",
      "**Ruby's Grasp:**",
      "- Damage increased by ~40%",
      "",
      "**Lucky Clover:**",
      "- Damage increased by 37.5%",
      "",
      "**Vamoose:**",
      "- Damage increased by 20%",
      "",
      "**Asher's Rise**",
      "- Addressed a scaling issue",
      "- Damage increased by 5%",
      "",
      "**Firmware Balance:**",
      "**Get Throwin':**",
      "- Ordnance Damage increased from 10% to 35%",
      "",
      "**Daed-dy O':**",
      "- Damage increased from 20% to 35%",
      "- Mag Size increase from 15% to 20%",
      "",
      "**Rubberband Man:**",
      "- Damage Reduction increased from 5% to 10%",
      "- Lifesteal increased from 5% to 10%",
      "",
      "**Jacked:**",
      "- Zoom-in Speed bonus increased from 20% to 35%",
      "- Hyperion Shield Capacity bonus increased from 25% to 50%",
      "- Ricochet chance increased from 30% to 40%",
      "",
      "**Atlas Ex:**",
      "- Mode Swap Speed increased from 25% to 33%",
      "- Damage while locked increased from 10% to 25%",
      "",
      "**Atlas Infinium:**",
      "- Fire Rate bonus increased from 5% to 12%",
      "- Damage bonus increased from 10% to 15%",
      "",
      "**Reel Big Fist:**",
      "- Explosion Radius slightly increased",
      "",
      "**Airstrike:**",
      "- Missile damage increased by 35%",
      "- Decreased Cooldown from 8s to 5s",
      "",
      "**UI, UX, & Text**",
      "- Restored filter functionality to Lost Loot menus and addressed non-functional filter selections and sorting dropdowns",
      "- Updated the Lost Loot menu so the selected sort option is retained after exiting and re-entering",
      "- Adjusted map icon layering so Main Mission icons no longer overlap Wildcard Mission _Giver_",
      "- Adjusted scrolling behaviors in menus in splitscreen",
      "- Ensured the Transfer Machine remains open after exiting inspect mode",
      "- Added separate sensitivity sliders for mouse and controller inputs in the Controls (Basic) menu on PC",
      "- Corrected the buddy widget display so respawned characters no longer appear as “still respawning”",
      "- Updated item rarity displays to show the correct color and tier when playing in non-English languages",
      "- Removed extra ECHO Log slots",
      "- Restored missing item thumbnails in the bank menu and improved loading speed for equipped and backpack item thumbnails when large numbers of items are stored in the bank",
      "- Updated Explore Menu positioning so it displays correctly in front of the explored region during vertical split-screen",
      "- Adjusted layout so Item Cards no longer overlap when compared in horizontal split-screen",
      "- Addressed a reported issue where weapons could unequip and disappear when changing their customization in the Status menu",
      "- Corrected overshield coloration and behavior for pets and buddy widgets so that health, shield, and armor visuals now display properly",
      "- Adjusted Contract trackers to only appear when the Contract is active",
      "- Resolved a reported issue where mission-related celebratory notifications could display duplicate icons",
      "- Added the missing “Restart to Apply Changes” prompt when adjusting texture quality during gameplay",
      "- Updated option descriptions to be more intuitive and player-friendly",
      "- Addressed the chaos displayed by the “SHiFT code is valid” countdown in the SHiFT menu",
      "- Updated controller prompts so the correct input type displays when opening the SHiFT menu from the main men",
      "- Removed an extra scrollbar that could appear when Reporting Users",
      "- Addressed text inconsistencies in some side missions",
      "- Updated D-pad functionality on controller to behave as expected",
      "- Preserved key bindings that could be removed between sessions for non-English keys",
      "- Standardized ECHO Log tracking for the Kairos Speaks challenge to ensure totals display consistently between general and mission log views",
      "- Updated localization, mission naming, and various text descriptions across the game",
      "- Updated end credits",
      "",
      "**Visuals**",
      "- Addressed reported instances where players could become invisible when performing a Vault-level transition during a travel tunnel",
      "- Addressed an issue with missing parts and textures on gear",
      "- Updated ECHO-4 character model and digistruct to have lights, eyes, and thruster effects appear correctly",
      "- Adjusted fishing point visuals so markers no longer appear incorrectly on terrain near Sandytoes Villa",
      "- Updated level geometry and collision across multiple regions to prevent players from becoming stuck, falling out of bounds, or being blocked by invisible surfaces",
      "- Adjusted grappling points and traversal paths in multiple missions to prevent players from chaining grapples into unintended areas or losing functionality",
      "- Addressed misplaced or inaccessible loot containers, including strongboxes and vending-area chests in The Wireworks and Windspear",
      "- Addressed inaccurate rendering of water in some locations",
      "- Corrected lingering slide smoke effects that could appear when moving or jumping after performing a slide",
      "- Turned off the mining laser after shutting down the second Eridium generator in Terminus Range",
      "- Corrected visual stretching on character and NPC cloth when adjusting the FOV while the game is paused",
      "- Updated _Dark Subject_ mission so Tim’s weapon now properly disappears with his model during the “Kill Tim”",
      "- Addressed multiple reported animation inconsistencies including gear, NPCs, hand stuttering, root-lock issues, and visual glitches during combat actions. These improvements remove visible sliding or snapping during melee or grapple sequences",
      "- Improved environmental synchronization in multiplayer",
      "- Adjusted mouth animation timing for Callis in _Another Day, Another Universe_ and for Numba One in _Mob Mentality_ so dialogue syncs correctly",
      "- Balanced underwater lighting and brightness near Belton’s Bore (The Low Leys, Mountains) for more consistent visual clarity when diving below the surface",
      "- Repaired a purple light texture that appeared after interacting with the Auger Shrine in Terminus Range",
      "- Optimized beam effects on some Order gear with lasers",
      "- Standardized bullet shell ejection visuals for Daedalus pistols",
      "- [SPOILER] The smoke during Sophia’s death wasn’t goth enough and was changed from orange to black",
      "- Updated the fade on digistruct to be less uniform",
      "- Resolved flickering from Exo-Soldier’s **PROJECT: Raiju** Capstone effect when used inside the Order Bunker",
      "- Updated vehicle materials to display correctly after applying paintjobs in the customization menu",
      "- Adjusted deployable barrier visuals on shields and _Shield Boi_",
      "- Faded the red light trails from Atlas underbarrel tracking Darts and Balls on Jakobs pistols",
      "- Tuned brightness of target marker visuals when using the Ripper Sniper Rifle tracking mode against certain bosses",
      "- Corrected firing animations for Vladof submachine guns with the Extra Barrel underbarrel and Torgue shotguns with Daedalus ammo switcher",
      "- Adjusted Order grenade to no longer slide across the ground when dropped from the inventory",
      "- Adjusted animation blending for Daedalus shotguns using Maliwan Element Switcher to eliminate abrupt snapping and to prevent the secondary magazine from appearing loaded when using the primary firing mode",
      "",
      "**Audio**",
      "- Resolved a reported issue where the crowd could continue to make sounds after they stopped spawning during the _Null and Void_ mission",
      "- Prevented host players from temporarily losing audio if another player joined their session while they were in an ECHO menu in multiplayer",
      "- Addressed missing or incomplete sound effects when looting in multiplayer sessions",
      "- Made the really loud bird in Grasslands quieter",
      "- Additional audio balance adjustments",
      "",
      "**Player Experience**",
      "- Improvements to stability and optimization<br>○ Dev Note: We are continuing to investigate and will make further improvements to stability and performance.",
      "- Updated PS5 controller LEDs to change color based on the player’s active elemental type",
      "- Addressed unintended adaptive trigger feedback that occurred with Ripper weapons while reloading or firing without ammo",
      "",
      "**Please restart your game to ensure that the update goes through and to prevent connection errors in matchmaking**",
      "- If you're encountering any issues, please [_contact 2K Support_](https://support.borderlands.com/hc/en-us/requests/new?ticket_form_id=32130122043795) for direct assistance. You can also read the [_PC Troubleshooting Guide_](https://support.borderlands.com/hc/en-us/articles/44493923901971-Borderlands-4-PC-Troubleshooting-and-Optimization-Guide), a list of [_known issues_](https://support.borderlands.com/hc/en-us/community/topics), or [_browse a list of Support threads here_](https://support.borderlands.com/hc/en-us/sections/39799542385299-Tech-Tinkering-Tips)",
      "- **View Them Here** https://borderlands.2k.com/borderlands-4/update-notes/"
    ]
  },
  {
    "title": "Update Notes - November 13, 2025",
    "imageUrl": "",
    "details": [
      "**Nothing Was Posted**",
      "- Hmm they posted the 13th but added nothing... proly cause of the delay on the update",
      "",
      "**Please restart your game to ensure that the update goes through and to prevent connection errors in matchmaking**",
      "- If you're encountering any issues, please [_contact 2K Support_](https://support.borderlands.com/hc/en-us/requests/new?ticket_form_id=32130122043795) for direct assistance. You can also read the [_PC Troubleshooting Guide_](https://support.borderlands.com/hc/en-us/articles/44493923901971-Borderlands-4-PC-Troubleshooting-and-Optimization-Guide), a list of [_known issues_](https://support.borderlands.com/hc/en-us/community/topics), or [_browse a list of Support threads here_](https://support.borderlands.com/hc/en-us/sections/39799542385299-Tech-Tinkering-Tips)",
      "- **View Them Here** https://borderlands.2k.com/borderlands-4/update-notes/"
    ]
  },
  {
    "title": "Update Notes - November 6, 2025",
    "imageUrl": "",
    "details": [
      "**Change Notes:**",
      "- Forgeknight's Dragon's Breath passive and Exo-Soldier's First Impression passive have been adjusted to apply the bonus amount to each projectile.<br>○ Dev Note: These passives were previously applying their bonus to the total amount of damage, rather than applying to each projectile. This results in an increase in damage to both, and makes them work as intended with guns that fire multiple pellets. ",
      "- Corrected the chance of Maliwan Legendary Sniper Rifle Complex Root dropping as Phosphene.",
      "",
      "**Please restart your game to ensure that the update goes through and to prevent connection errors in matchmaking**",
      "- If you're encountering any issues, please [_contact 2K Support_](https://support.borderlands.com/hc/en-us/requests/new?ticket_form_id=32130122043795) for direct assistance. You can also read the [_PC Troubleshooting Guide_](https://support.borderlands.com/hc/en-us/articles/44493923901971-Borderlands-4-PC-Troubleshooting-and-Optimization-Guide), a list of [_known issues_](https://support.borderlands.com/hc/en-us/community/topics), or [_browse a list of Support threads here_](https://support.borderlands.com/hc/en-us/sections/39799542385299-Tech-Tinkering-Tips)",
      "- **View Them Here** https://borderlands.2k.com/borderlands-4/update-notes/"
    ]
  },
  {
    "title": "Update Notes - October 30, 2025",
    "imageUrl": "",
    "details": [
      "**Change Notes:**",
      "- The Gravitar Class Mod, Reactor, now drops from Inceptus as intended. ",
      "- The Order Legendary Grenade Skully has been adjusted to properly increase damage of projectiles at higher levels. Also addressed an audio issue with the fire effects that were causing it to not lower in volume with distance.",
      "- Corrected the Knife Penetrator Augment, which was unintentionally setting all attacks to a 30% critical chance.",
      "- Interacting with Dr. Zed’s Meds and Guns vending machines and Lost Loot machines will now reset any Action Skills, Ordnance, or Repkits currently on cooldown.",
      "- Reduced the audio volume on the wings of world boss Spidananggal.",
      "",
      "**Please restart your game to ensure that the update goes through and to prevent connection errors in matchmaking**",
      "- If you're encountering any issues, please [_contact 2K Support_](https://support.borderlands.com/hc/en-us/requests/new?ticket_form_id=32130122043795) for direct assistance. You can also read the [_PC Troubleshooting Guide_](https://support.borderlands.com/hc/en-us/articles/44493923901971-Borderlands-4-PC-Troubleshooting-and-Optimization-Guide), a list of [_known issues_](https://support.borderlands.com/hc/en-us/community/topics), or [_browse a list of Support threads here_](https://support.borderlands.com/hc/en-us/sections/39799542385299-Tech-Tinkering-Tips)",
      "- **View Them Here** https://borderlands.2k.com/borderlands-4/update-notes/"
    ]
  }
]
