[
                {
"id": "Update 1.2 : New Site",    
"active": true, 
"lastUpdateText": "Hey You",
"buttonDate": "2/26/2026",
"messageTitle": "Hope Your Keeping Safe, And Enjoying Life",
"messageContent": "<b>Long Time No Read Eh LOL</b><br><br>So.. I have been and again will keep updating the site, I know broken record at this point.. I will be 100% honest tho I was getting dono's here and there ovb kofi takes some and the converts from usa to cad suck ass... Cad's money is not worth anymore then the usa's so not sure why hits are so bad.. but Still want to thank you guys who did donate and the other who did a few times.. They have pretty much fully stopped now and ya is it what it...<br><br> But Want to thank someone Special and that is > Wil aka (Tillamon...) Thanks for chatting and checking in on me every day and that and even the dono's you have done man to help me with some snacks and things for daughter I cant thank you enough but being a good friend back to you.<br><br><b>Im shocked bl4 took the hit it did</b><br>Many of you proly are as well, I know destiny 2 gets a bad name and with the dlc/content delay for that... they still pull numbers and do well unlike how bad the bl4 players have dropped off not sure if its from Randy him self or gear or just the game overall.. If you read this put what you think in the comments when asked if you like this lil post/update :) <br><br><br><b>Been enjoying Fallout76 alot</b><br>So wife got me back into the game, yes its super old lol but has alot of players, cool events, updates and things to do...If you don't know you can cell items on the game so cause I have so much even made a tool/site to help peeps see items i cant list on game (slots being full) <a href='https://xsmashx88x.github.io/SMASHFO76ITEMS/'>Click To See The New Tool (PS NO THIS IS NOT A DONO THING)</a> Just something for me to share on game at my camp/reddits and discords when doing selling/trading of items, Do any of you gamers play? I know cross play is not a thing but might be soon so :)"
},  
        {
"id": "update 1.1",    
"active": false, 
"lastUpdateText": "Deadsite Updating",
"buttonDate": "2/9/2026",
"messageTitle": "Hope everyone has been good.",
"messageContent": "<b>Eh Gamers </b><br><br>So Many of you proly think I am not or that I am done with the site, I am not... I still am dealing with stuff but as can see always update blackmarket info and post new keys once randy or studio does... I like you all hate how bad its become with randy now slowing down so much but eh it happens... Even tho I know this site is pretty much dead... As no one does buttons, few dono's i was getting are now stopped completely and even the background give away thing no one cares for so this all sucks :( <br> I am still doing the all year around background gifts to randoms peeps via > <a href='https://tally.so/r/LZ9NBJ'>CLICK ME FOR A CHANCE TO WIN A FREE BACKGROUND</a> An ovb custom ones for the tippers/supporters of me/site and that...<br><br>If i was to do another tool like this for other games would you use it?<br>"
},  
{
"id": "update 1.0",    
"active": false, 
"lastUpdateText": "Whats Happening",
"buttonDate": "1/10/2026T",
"messageTitle": "Hope everyone has been good.",
"messageContent": "<b>Eh Gamers </b><br><br>Thanks to everyone who showed love and support via adding me on discord and even just hitting me on via buttons and again expressing love, caring for a random person online and that I cant express how this made me feel.... like wow <br><div style='color: orange;'><details><summary>Still a hater even after all this time wtf</summary><b>Hate has slowed down, still get trolls telling me to um D** or to KMS, </b><br><br>But the fact there is one who scans a webhook link to then spam the webhook (i use moded discord so the messages was filtered) just funny to me that someone is so stupid and hateful this was done before and had to private and route them and i left this one open cause it was lil before ended up in the hostpial and didnt change it and ya <img src='https://raw.githubusercontent.com/xsmashx88x/-xsmashx88x/main/otherish/%5BDate%20%202026-01-09%5D%20%2B%20%5BTime%20%2008-06-18PM%5D.png' alt='image' style='max-width: 100%; height: auto;'></details></div><br> I am still doing the all year around background gifts to randoms peeps via > <a href='https://tally.so/r/LZ9NBJ'>CLICK ME FOR A CHANCE TO WIN A FREE BACKGROUND</a> An ovb custom ones for the tippers/supporters of me/site and that...<br><br>If i was to do another tool like this for other games would you use it?<br>"
},  
{
"id": "New Year",    
"active": false, 
"lastUpdateText": "Health + Updates + More",
"buttonDate": "12/27/2025 - 12:45 pm EST",
"messageTitle": "Still striving to be the best for you + Happy Holidays & Stay Safe",
"messageContent": "<b>Update time, This will be alot...</b><br><br>I spent a week in the hospital.<br><div style='color: orange;'><details><summary>Here is why (click to expand)</summary><b>With Pills/Treatment and Such...</b><br><br>I was getting worse with the blood coughing up and and the clots coming up, So they took blood samples from lungs and so many blood test and more... that arms and hands are messed up...wont post pics here but its bad <br><br>With that other lvl's and things started to show failue.. Meds I was on did damage to kidneys and few others and then i started to show low oxygen in blood and ya, this triggered more meds and blood and it was just a mess... My body sucks pretty much<br><br>So was just easy for them to keep me hoocked up, looked after and taken care of there then me being at home...<br><br> This sadly is not over and in the new year more test/treatments/pills and hospital visists will happen but note...<br><br> VAULT HUNTERS : I will always update any codes the only thing that wont be is the black market/weekly stuff as I don't have a laptop/game on laptop to do updating at the hospital... all the info i grab via my home shitty pc so :) ... Codes will always go up if cell signal is good and im chilling as I missed two codes i think the rest i was able to update fast</div></details><br> Before this took place, I was doing xmas gift... and you know what.. From all the feedback and heartfelt messages (some of you shared) same kinda stuff... was heartwarming to read... for the year if you expand the part below the blue one and do that,, every few days you gamers will be picked at random and gifted :) <br><br><div style='color: cyan;'><details><summary>Lets Keep Gifting even tho xmas is done :)  (click to expand)</summary><b>This site is not a burden—it's my passion.</b><br><br>Some of you feel its a burden to run this its not... I again have alot going on an this keeps me busy... for most part... so with that<br><br><a href=\"https://tally.so/r/LZ9NBJ\">https://tally.so/r/LZ9NBJ - CLICK ME FOR A CHANCE TO WIN A FREE BACKGROUND</a></div></details><br>Again, Its Not a burden... I love the msg's and kinda words and that... I cant thank you enough for you guys caring and that... Words cant express to me how nice it is to see/read.. for yous who said you have stuff.... contact info is above so if you want add me on discord... I am always down to chat.. some of you chat daily with me and its damn nice to have that :) <br><br><div style='color: Pink;'><details><summary>Community & Support  (click to expand)</summary><b>To the community</b><br><br><i>To the few who send hate: This site is free, ad-free, Signin/Login-free,  and runs on passion. I'm just a person trying to create an all-in-one hub for Borderlands fans, covering everything from BL4 news to older Shift codes for the older borderland gamers as well, despite my health battles. </i><br><br><b>To the supporters/Who Want to Support : </b><br>Gamers, Its always welcomed..Its not a must not needed... Some of you have expressed you want to give and give alot but cant cause of money... This is fine gamers.. Life/You  come first before tipping a site that give updates/keys and such plz... Don't stress about supporting me.<br> Rather see you guys have money for things/family/needs and such before even ever thinking on sending it to me...<br> Times are hard for all so don't ever feel you need to..<br><br><br> I HAVE AND NEVER WILL BE ABOUT MONEY, THIS IS FOR EVERYONE AND WILL STAY EVEN IF IT ALL STOPPED. I LOVE UPDTING AND GIVING THIS TOOL TO YOU EPIC VAULT HUNTER GAMERS :) <br><br>everyone else again thank you as well (daughter got some gifts and is happy) </div></details><br> Thank you for taking the time to read this. If you felt I wasted your time, I apologize. However, if any of you are going through your own battles—health or otherwise—and need to vent, my DMs on Discord/Twitter are always open. We are all fighting something, and I am here for you guys just as much as you are there for me."
},     
        {
    "id": "Backhome",
    "active": false,
    "lastUpdateText": "Out of hospital : give me a few plz",
    "buttonDate": "12/24/2025 - 2:200 pm EST",
    "messageTitle": "Let me get home and will update things",
    "messageContent": "I am out of the hospital now, still have alot of things to come but, once I am home and unpacked and can chill for a lil will update the missed codes/market stuff and whatever else is missed, Sorry let you guys down and not being the fastest to update over the last 6 days... Will try and keep on top or bring crap tablet if in hospital to update if i end up back in... Again sorry for letting you all down. ",
    "image_url": ""
  }, 
    {
    "id": "UrgentHealthUpdate",
    "active": false,
    "lastUpdateText": "Urgent Health Update - still in Hospital",
    "buttonDate": "12/23/2025 - 2:20 pm EST",
    "messageTitle": "A Quick, Urgent Health Update - still in the Hospital",
    "messageContent": "I am sorry gamers i been trying to update codes as they come hard to when hands are swollen and have iv and such out them, I plan to post the new 12 days keys and anything else later, i am getting treatments and test so its not so easy to.",
    "image_url": ""
  }, 
  {
    "id": "UrgentHealthUpdate",
    "active": false,
    "lastUpdateText": "Urgent Health Update - Back in Hospital",
    "buttonDate": "12/19/2025 - 3:50 pm EST",
    "messageTitle": "A Quick, Urgent Health Update - Back in the Hospital",
    "messageContent": "<img src='https://raw.githubusercontent.com/xsmashx88x/-xsmashx88x/refs/heads/main/hos/IMG_9592.jpeg' style='width:100%; border-radius:12px; margin-top:10px; margin-bottom:20px; border: 1px solid #444;'><br>Hey everyone,<br><br>I'm writing this with a heavy heart to let you know that my health issues have taken a turn for the worse, and I'm currently back in the hospital. It looks like I'll be here for the next few days as the doctors work to get things stabilized.<br><br>As many of you know, I deal with severe health challenges, and unfortunately, this is one of those tougher periods.<br><br>This means updates to the site will be delayed during this time. I'll get everything current as soon as I'm back home and able to.<br><br>Thank you so much for your understanding and continued support. It truly means a lot, especially now.<br><br>I'll keep you posted when I have more news. Stay safe out there, gamers",
    "image_url": "https://raw.githubusercontent.com/xsmashx88x/-xsmashx88x/refs/heads/main/hos/IMG_9592.jpeg"
  },                
{
"id": "Happy Days",    
"active": false, 
"lastUpdateText": "Click An Maybe Win",
"buttonDate": "12/13/2025 - 11:52 pm EST",
"messageTitle": "Thanks for kind words, over last few days from everyone via the buttons :)",
"messageContent": "<b>So this will be a diff kinda post.. I want to give back to you but this will be to random peeps.</b><br><br>So all you gotta do is click link below, fill it out. I will over coming days/week or weeks send you gamers back something IF PICKED.<br><div style='color: cyan;'>Need this info to be able to gift if you win what you want <a href=\"https://tally.so/r/LZ9NBJ\" target=\"_blank\">Click On This to fill this out and have a chance to win :)</a></div><br><br><div style='color: cyan;'>can still hit the thumbs up and drop nice comment for extra points (add name you use on forum so can know :)</div>"
},  
{
"id": "Health Ish",    
"active": false, 
"lastUpdateText": "Health & Site Updates",
"buttonDate": "12/8/2025 - 10:17 am EST",
"messageTitle": "Always striving to be the best for you + Happy Holidays & Stay Safe",
"messageContent": "<b>Just a quick update on what's going on behind the scenes regarding recent delays.</b><br><br>I spent most of yesterday at the hospital.<br><div style='color: pink;'><details><summary>Here is why (click to expand)</summary><b>The reality of the situation,</b><br><br>Some of you who read these updates know I battle with Lupus APS, and Vasculitis and other health issues. Unfortunately, my last treatment is wearing off, which has led to some severe complications—specifically bleeding in the lungs (ground glass opacities) and blood clots (which had one in left lung as well in the past they had to treat).<br> So reason for going I was coughing up blood and blood clots, and my team of docs about 6/7 i have on file or more have said this happens you go. <br> It is a daily battle I wouldn't wish on my worst enemy. Because of the severity, I've been put back on a high dose of prednisone and have to undergo extensive testing and 6-8 hour treatment infusions over the coming weeks just to keep functioning.</div></details><br>I have a lot of long appointments coming up to keep me alive, an not dying cause of clots and able to live a somewhat normal life with not as much pain and discomfort <br><br><div style='color: cyan;'><details><summary>What this means for the site (click to expand)</summary><b>This site is not a burden—it's my passion.</b><br><br>I am an open book, and I want you gamers to know that if there is a delay, there is a valid reason. I try to update codes even from shitty hospital Wi-Fi, but since I handle everything manually (grabbing info, merging images, video paths), I can't always do it until I get home to my setup.<br><br> It hurts me to feel like I'm letting you down when I miss a reset time or posting codes the min randy does them, but please know I am doing my absolute best between treatments + appointments + day to day battles</div></details><br> I know this is heavy to read, but I value transparency with you gamers and epic community we have here<br><br><div style='color: red;'><details><summary>Community & Support  (click to expand)</summary><b>To the community</b><br><br><i>To the few who send hate: This site is free, ad-free, Signin/Login-free,  and runs on passion. I'm just a person trying to create an all-in-one hub for Borderlands fans, covering everything from BL4 news to older Shift codes for the older borderland gamers as well, despite my health battles. </i><br><br>To the supporters: You guys keep me going. Donations are never required, but for those who have been so generous (over $5), I'm now offering custom-designed backgrounds for any device as a small token of my gratitude. I want to give back to those who help keep this ship afloat.<br><br>everyone else again thank you as well</div></details><br> Thank you for taking the time to read this. If you felt I wasted your time, I apologize. However, if any of you are going through your own battles—health or otherwise—and need to vent, my DMs on Discord/Twitter are always open. We are all fighting something, and I am here for you guys just as much as you are there for me."
},  
{
"id": "Thanks Gamers",    
"active": false, 
"lastUpdateText": "Cant Thank You Gamers Enough 🫂🤗",
"buttonDate": "11/30/2025 - 4:10 pm EST",
"messageTitle": "Cant express how much this has helped, done for me like wow",
"messageContent": "<b>Thanks everyone</b><br><br>I cant thank you gamers enough below is health update, an li bit of info on what I have... expand or check older post below.<br><details><summary>health update ish</summary><div style='color: darkred;'><b>Thanks again everyone</b><br><br>I cant thank you gamers enough for understanding one thing.. I am open about it, I have lupus APS + Vasculitis + Other health issues, I have good and bad days and certain times of the year I get sick worse and end up in the hospital cause of how bad I am spitting up blood or cause they have to up my meds again to massive amount until I can get my treatment<br>Or I have days where hands/arms/legs/feet are swollen and just hurt to move/use... this shit I have is the worse.<br>Treatments are every 5/6 months which again is not fun 6/8hours for treatment via IV fucking sucks, So again if Im not at the hospital/appointments/treatments I will always try and update info within the hour of being posted/updated, If at something I will update once home, So thanks for understanding that gamers<br><br>I am still banned on reddit which sucks so i know peeps over there are posting codes right when they do or few hours after as some of you still use this reddit.. so again 99% of times i am faster then all.<br><br>Thanks again for you gamers who donated, some of you did the 5$ and some of you did 30/50$. Again was never a thing needed to do or have to but the few dono's have helped me alot<br>(check kofi dm's gamer who did bigger got a dm for a custom background gift from me)<br>Reason Is I got a 9 year old lil girl so been able to get her some gifts cause of you gamers<br>Thanks again for the few of you who was able to support this site/work I have done<br>(hating peeps just stop I didnt make millions smh.. made a few dollars, stop hating on a free thing)<br><br><br><s><b>Hey everyone,</b><br><br>Some of you know, I have list of health issues and today you can proly guess where I was.. back home now so will be updating blackmarket stuff sorry for the delay :(</s></div></details><br>The reason I am posting this today.. Is again to thank you all.. for the 5$ and gamers who went 30/40/50$ its not about the money but it has helped me be able to get some things for my daughter. I suffer from health issues/mh issue an other things and cause of it cant work.. so this lil bit of extra money will help with getting gifts/other items  an such. I proly should not be sharing this but, I got dealt a shit hand as you gamers can see and you gave me joy and happiness.. I love that you gamers love what I have done here and will Keep doing it.. even with a hour or two delay on updating codes or bm info.<br><br> Just means alot, Dono's have slowed down and know some think I plan to end this project I don't plan on it. I use it, you use it, friends and fam use it.. So its staying.. I love bl4 even with the bugs and flaws and randys random but stupid tweets lol I will keep bringing updates an new codes here... As long as you gamers keep using it <br><br> For you gamers who did donate above the default one 🍵, plz plz plz check kofi dm's as wallpaper info is needed."
},  
                {
"id": "Health Ish, Sorry for late update",    
"active": false, 
"lastUpdateText": "health ish sucks",
"buttonDate": "11/21/2025 - 9:53 am EST",
"messageTitle": "Sorry and thanks for understanding, and also helping [sorry if below is hard to read]",
"messageContent": "<b>Thanks again everyone</b><br><br>I cant thank you guys enough for understanding one thing.. I am open about it, I have lupus APS + Vasculitis + Other health issues, I have good and bad days and certain times of the year I get sick worse and end up in the hospital cause of how bad I am spitting up blood or cause they have to up my meds again to massive amount until I can get my treatment<br>Or I have days where hands/arms/legs/feet are swollen and just hurt to move/use... this shit I have is the worse.<br>Treatments are every 5/6 months which again is not fun 6/8hours for treatment via IV fucking sucks, So again if Im not at the hospital/appointments/treatments I will always try and update info within the hour of being posted/updated, If at something I will update once home, So thanks for understanding that gamers<br><br>I am still banned on reddit which sucks so i know peeps over there are posting codes right when they do or few hours after as some of you still use this reddit.. so again 99% of times i am faster then all.<br><br>Thanks again for you guys who donated, some of you did the 5$ and some of you did 30/50$. Again was never a thing needed to do or have to but the few dono's have helped me alot<br>(check kofi dm's guys who did bigger got a dm for a custom background gift from me)<br>Reason Is I got a 9 year old lil girl so been able to get her some gifts cause of you guys<br>Thanks again for the few of you who was able to support this site/work I have done<br>(hating peeps just stop I didnt make millions smh.. made a few dollars, stop hating on a free thing)<br><br><br><s><b>Hey everyone,</b><br><br>Some of you know, I have list of health issues and today you can proly guess where I was.. back home now so will be updating blackmarket stuff sorry for the delay :(</s>"
},
        {
"id": "Reddit ish....",    
"active": false, 
"lastUpdateText": "Reddit WTF",
"buttonDate": "11/11/2025 - 10:12 pm EST",
"messageTitle": "All for trying to help like smfh",
"messageContent": "<b>Hey everyone,</b><br><br>So I am now shadow banned on reddit, all post removed... even the post about the site which so many did post and comment on.. cause reddit says account was spamming like wtf... I was posting codes to 2 borderlands subbits and one I made, I don't get why when I try an do something good like posting for months like i have been each time he post codes.. and that NOW all of a sudden now.... this shit is happening... like almost 250k or 300k views this thing had https://www.reddit.com/r/Borderlands/comments/1npcmrf/shift_code_tracker/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button and now look like wtf reddit <br><br> plz now more then ever share the site, tell ya friends/family an others.. cause main source for peeps knowning is now fucking gone cause of reddit...<br><br>Thumbs up : if think its bs<br>Thumbs down : if you agree should be kept banned"
},
    {
"id": "Sorry About This.....",    
"active": false, 
"lastUpdateText": "Haters An Trolls",
"buttonDate": "11/7/2025 - 11:13 am EST",
"messageTitle": "Things might be broken, working on it",
"messageContent": "<b>Hey everyone,</b><br><br>So, I woke up to someone troll/dipshit which what they did harms no one, just annoying on my end... they looked at the code found the webhooks urls, where the sending codes/polls/feedback and such go to... an spammed discord links, hate msg, an just troll/hater type shit... with that again its not a big deal just annoying to purge and clear... So I didnt want to but the repo is now private and page is still public.<br><br><b>Had to pay for pro account</b><br>It sucks i had to do this, as any other way would change the url, breaking the site url you all know.. So haters/trolls screw you, cant spam the webhook urls now.. cause they all got redone and old ones deleted and out money cause of you so thanks.. thinking your cool/funny again your not and its lame what you did again hating on this so much to waste your time for a few mins of enjoyment smfh<br><br><b>So I am relinking things and checking things</b><br> Contact me on discord if something is really broke or use right report buttons plz."
},
  {
"id": "HMM.....",    
"active": false, 
"lastUpdateText": "HMM.....",
"buttonDate": "11/3/2025 - 2:30 pm EST",
"messageTitle": "A Note on Recent Changes and Moving Forward",
"messageContent": "<b>Hey everyone,</b><br><br>I'm writing this today to talk about the recent updates and the feedback I have received. I'm always striving to improve your experience, and a big part of that is listening to what you have to say. Many of the recent changes were direct results of polls and feedback from you, the community. My goal was to implement the features that you asked for, and I was excited to bring them to life.<br><br>However, alongside the positive and constructive feedback, there has been a significant amount of negativity and hate. This has come through in reports, the feedback button, and even direct messages on Discord and Reddit. To be clear, I'm not talking about constructive criticism – that's always welcome. I'm referring to hateful, non-constructive, and frankly, abusive comments. This has been disheartening, to say the least.<br><i>Sad people can be so hateful/bashful again on a free project/site that allows you to track/hide redeemed things...some of you even hate me making post like this... like man, Am sorry for making post like this, but hopefully it would change haters into lovers as they can see the reason for things is feedback/votes and NOT JUST THEM, as many use the site not just them.</i><br><br>The passion of this community is one of its greatest strengths, but the toxicity of a vocal minority can be incredibly damaging. It's especially frustrating when the changes being attacked are the very same ones the community voted for.<br><br>In response to the mixed feedback, and in an effort to give everyone more control over their experience, I've spent a considerable amount of time and effort implementing a range of new options. I honestly had no idea how much time this would take, but I felt it was important to provide a solution that works for everyone.<br><br>There are now <i><b>seven different options</i></b> that allow you to hide or change the new features. If you're not a fan of some of the recent updates, you can simply open the <i><b>⚙️ GEAR button in the corner</i></b> and customize your experience to your liking. This way, those who want the new features can enjoy them, and those who don't can opt-out of seeing them.<br><i>So stop with the to many buttons, its to ugly and so on HIDE STUFF or use diff layouts</i><br><br>I want to extend a huge thank you to everyone who has been supportive and has provided constructive feedback. Your messages of encouragement and thoughtful suggestions are what keep me going. You are the heart of this community, and I truly appreciate you.<br><br>For those who continue to send hateful messages, I urge you to reconsider your approach, Or just stop using this site. This project is a labor of love, and while I'm more than happy to listen to your concerns, I will not tolerate abuse, cause you fail to use options to hide/change layouts.. Or cause people want to support via tips/donations.<br><br>Moving forward, I'll continue to listen to your feedback and make improvements. Please continue to share your thoughts through the proper channels, but let's keep the conversation respectful and constructive. Let's work together to make this a positive and welcoming community for everyone.<br><br><i>Thank you for your understanding and reading this, If can support would mean alot, as said above had no clue how much time would be spent on this updating/changing/fixing/redoing codes an more thank you</i>"
},
{
"id": "📹Speaking On The Site, Hate, Options An More",  
"active": false, 
"lastUpdateText": "📹Speaking On The Site, Hate, Options An More",
"buttonDate": "10/25/2025 - 2:30 pm EST",
"messageTitle": "Proly should not of done this lol",
"messageContent": "Made a review vid but also talk about few things that I hate and some bs but mostly a review of diff things and why things got added and and talk about buttons you gamers might not even know about<br><br>Cause it seems many of you dont <i>Refresh</i><br><br><b>how do I know this?</b> <i>cause you guys send me in codes that have been added for days/or got added the second they was posted... PLZ ALWAYS REFRESH</i>",
"imageUrl": "https://www.youtube.com/embed/6OfsvCjlsvs?si=lxEhUgqaAVN7HPQF"
},
{
"id": "🫂🤗 Love, An Hate 🤬",  
"active": false,
  "lastUpdateText": "🫂🤗 Love, An Hate 🤬",
  "buttonDate": "10/20/2025 - 5:33 am EST",
  "messageTitle": "The Good, The Bad (this will be used as a live update/msg to you all :) ",
  "messageContent": "So the post I did yesterday still stands, thank you gamers.. still getting, nvm it don't matter i cant win smfh...7layouts + fixes still getting slammed... codes should be on top buttons at bottom and on front page.. they are on front (enable codes only mode/hide ish options) to remove them button.. like holy at this point I don't know what to do to..<details>\n  <summary><i>Did this post around 5pm on 10/19/2025 explains some things (click to expand)</i></summary>\n  <p>Vault Hunter, Again just want to thank you all, for being damn epic and showing love, via msgs/post/input buttons... again means alot reading all the love not going to lie was heart warming and made my day...<br><br> I know to focus on haters I should not do but I dunno I wanna make everyone happen even them.. hence me having the post about Multi Pc/Mobile layouts and Updated Hide options/Layout (spending time adding them and even redoing mobile stuff and also fixing the modal windows) ... and wanted to also let them know the dono is not going anywhere.. and that yes sometimes codes might be a hour or few hours late...<br><br> I have a life, Kid, An Health issues where I have ups and downs or sometimes multiple appointments in a week/treatments every few months.. so I will always try and update the codes as soon as i get wind of them or see them, but you will always have days to redeem them as i will never add a code that will expire a hour later or be that late. <br><br>Sorry for the long read.. I feel i should of been more professional and thats why the old msg is gone and went this way as well..sorry for you all having to read that.. just hate getting hate when just want to help bl gamers <br><br> Haters, I i took your hate and in return added and changed things so before keeping it going check out the options/new buttons an things before you think about sending the hate.. Not going to lie some of you had me thinking twice.</p>\n</details>"
}
]
