[
        {
"id": "Reddit ish....",    
"active": true, 
"lastUpdateText": "Reddit WTF",
"buttonDate": "11/11/2025 - 10:12 pm EST",
"messageTitle": "All for trying to help like smfh",
"messageContent": "<b>Hey everyone,</b><br><br>So I am now shadow banned on reddit, all post removed... even the post about the site which so many did post and comment on.. cause reddit says account was spamming like wtf... I was posting codes to 2 borderlands subbits and one I made, I don't get why when I try an do something good like posting for months like i have been each time he post codes.. and that NOW all of a sudden now.... this shit is happening..."
},
    {
"id": "Sorry About This.....",    
"active": false, 
"lastUpdateText": "Haters An Trolls",
"buttonDate": "11/7/2025 - 11:13 am EST",
"messageTitle": "Things might be broken, working on it",
"messageContent": "<b>Hey everyone,</b><br><br>So, I woke up to someone troll/dipshit which what they did harms no one, just annoying on my end... they looked at the code found the webhooks urls, where the sending codes/polls/feedback and such go to... an spammed discord links, hate msg, an just troll/hater type shit... with that again its not a big deal just annoying to purge and clear... So I didnt want to but the repo is now private and page is still public.<br><br><b>Had to pay for pro account</b><br>It sucks i had to do this, as any other way would change the url, breaking the site url you all know.. So haters/trolls screw you, cant spam the webhook urls now.. cause they all got redone and old ones deleted and out money cause of you so thanks.. thinking your cool/funny again your not and its lame what you did again hating on this so much to waste your time for a few mins of enjoyment smfh<br><br><b>So I am relinking things and checking things</b><br> Contact me on discord if something is really broke or use right report buttons plz."
},
  {
"id": "HMM.....",    
"active": false, 
"lastUpdateText": "HMM.....",
"buttonDate": "11/3/2025 - 2:30 pm EST",
"messageTitle": "A Note on Recent Changes and Moving Forward",
"messageContent": "<b>Hey everyone,</b><br><br>I'm writing this today to talk about the recent updates and the feedback I have received. I'm always striving to improve your experience, and a big part of that is listening to what you have to say. Many of the recent changes were direct results of polls and feedback from you, the community. My goal was to implement the features that you asked for, and I was excited to bring them to life.<br><br>However, alongside the positive and constructive feedback, there has been a significant amount of negativity and hate. This has come through in reports, the feedback button, and even direct messages on Discord and Reddit. To be clear, I'm not talking about constructive criticism – that's always welcome. I'm referring to hateful, non-constructive, and frankly, abusive comments. This has been disheartening, to say the least.<br><i>Sad people can be so hateful/bashful again on a free project/site that allows you to track/hide redeemed things...some of you even hate me making post like this... like man, Am sorry for making post like this, but hopefully it would change haters into lovers as they can see the reason for things is feedback/votes and NOT JUST THEM, as many use the site not just them.</i><br><br>The passion of this community is one of its greatest strengths, but the toxicity of a vocal minority can be incredibly damaging. It's especially frustrating when the changes being attacked are the very same ones the community voted for.<br><br>In response to the mixed feedback, and in an effort to give everyone more control over their experience, I've spent a considerable amount of time and effort implementing a range of new options. I honestly had no idea how much time this would take, but I felt it was important to provide a solution that works for everyone.<br><br>There are now <i><b>seven different options</i></b> that allow you to hide or change the new features. If you're not a fan of some of the recent updates, you can simply open the <i><b>⚙️ GEAR button in the corner</i></b> and customize your experience to your liking. This way, those who want the new features can enjoy them, and those who don't can opt-out of seeing them.<br><i>So stop with the to many buttons, its to ugly and so on HIDE STUFF or use diff layouts</i><br><br>I want to extend a huge thank you to everyone who has been supportive and has provided constructive feedback. Your messages of encouragement and thoughtful suggestions are what keep me going. You are the heart of this community, and I truly appreciate you.<br><br>For those who continue to send hateful messages, I urge you to reconsider your approach, Or just stop using this site. This project is a labor of love, and while I'm more than happy to listen to your concerns, I will not tolerate abuse, cause you fail to use options to hide/change layouts.. Or cause people want to support via tips/donations.<br><br>Moving forward, I'll continue to listen to your feedback and make improvements. Please continue to share your thoughts through the proper channels, but let's keep the conversation respectful and constructive. Let's work together to make this a positive and welcoming community for everyone.<br><br><i>Thank you for your understanding and reading this, If can support would mean alot, as said above had no clue how much time would be spent on this updating/changing/fixing/redoing codes an more thank you</i>"
},
{
"id": "📹Speaking On The Site, Hate, Options An More",  
"active": false, 
"lastUpdateText": "📹Speaking On The Site, Hate, Options An More",
"buttonDate": "10/25/2025 - 2:30 pm EST",
"messageTitle": "Proly should not of done this lol",
"messageContent": "Made a review vid but also talk about few things that I hate and some bs but mostly a review of diff things and why things got added and and talk about buttons you gamers might not even know about<br><br>Cause it seems many of you dont <i>Refresh</i><br><br><b>how do I know this?</b> <i>cause you guys send me in codes that have been added for days/or got added the second they was posted... PLZ ALWAYS REFRESH</i>",
"imageUrl": "https://www.youtube.com/embed/6OfsvCjlsvs?si=lxEhUgqaAVN7HPQF"
},
{
"id": "🫂🤗 Love, An Hate 🤬",  
"active": false,
  "lastUpdateText": "🫂🤗 Love, An Hate 🤬",
  "buttonDate": "10/20/2025 - 5:33 am EST",
  "messageTitle": "The Good, The Bad (this will be used as a live update/msg to you all :) ",
  "messageContent": "So the post I did yesterday still stands, thank you gamers.. still getting, nvm it don't matter i cant win smfh...7layouts + fixes still getting slammed... codes should be on top buttons at bottom and on front page.. they are on front (enable codes only mode/hide ish options) to remove them button.. like holy at this point I don't know what to do to..<details>\n  <summary><i>Did this post around 5pm on 10/19/2025 explains some things (click to expand)</i></summary>\n  <p>Vault Hunter, Again just want to thank you all, for being damn epic and showing love, via msgs/post/input buttons... again means alot reading all the love not going to lie was heart warming and made my day...<br><br> I know to focus on haters I should not do but I dunno I wanna make everyone happen even them.. hence me having the post about Multi Pc/Mobile layouts and Updated Hide options/Layout (spending time adding them and even redoing mobile stuff and also fixing the modal windows) ... and wanted to also let them know the dono is not going anywhere.. and that yes sometimes codes might be a hour or few hours late...<br><br> I have a life, Kid, An Health issues where I have ups and downs or sometimes multiple appointments in a week/treatments every few months.. so I will always try and update the codes as soon as i get wind of them or see them, but you will always have days to redeem them as i will never add a code that will expire a hour later or be that late. <br><br>Sorry for the long read.. I feel i should of been more professional and thats why the old msg is gone and went this way as well..sorry for you all having to read that.. just hate getting hate when just want to help bl gamers <br><br> Haters, I i took your hate and in return added and changed things so before keeping it going check out the options/new buttons an things before you think about sending the hate.. Not going to lie some of you had me thinking twice.</p>\n</details>"
}
]
