[
{
"id": "Health Ish",    
"active": true, 
"lastUpdateText": "Health & Site Updates",
"buttonDate": "12/8/2025 - 10:17 am EST",
"messageTitle": "Always striving to be the best for you + Happy Holidays & Stay Safe",
"messageContent": "<b>Just a quick update on what's going on behind the scenes regarding recent delays.</b><br><br>I spent most of yesterday at the hospital.<br><details><summary>Here is why</summary><div style='color: pink;'><b>The reality of the situation,</b><br><br>Some of you who read these updates know I battle Lupus APS, and Vasculitis. Unfortunately, my last treatment is wearing off, which has led to some severe complications—specifically bleeding in the lungs (ground glass opacities) and blood clots. It is a daily battle I wouldn't wish on my worst enemy. Because of the severity, I've been put back on a high dose of prednisone and have to undergo extensive testing and 6-8 hour treatment infusions over the coming weeks just to keep functioning.</div></details><br>I have a lot of long appointments coming up to keep me alive, an not dying cause of clots and able to live a somewhat normal life with not as much pain and discomfort <br><br><details><summary>What this means for the site</summary><div style='color: cyan;'><b>This site is not a burden—it's my passion.</b><br><br>I am an open book, and I want you gamers to know that if there is a delay, there is a valid reason. I try to update codes even from shitty hospital Wi-Fi, but since I handle everything manually (grabbing info, merging images, video paths), I can't always do it until I get home to my setup.<br> It hurts me to feel like I'm letting you down when I miss a reset time or posting codes the min randy does them, but please know I am doing my absolute best between treatments.</div></details><br> I know this is heavy to read, but I value transparency with you gamers and epic community we have here<br><br><details><summary>Community & Support</summary><div style='color: red;'><b>To the community</b><br><br>To the few who send hate: This site is free, ad-free, and runs on passion. I'm just a person trying to create an all-in-one hub for Borderlands fans, covering everything from BL4 news to older Shift codes, despite my health battles. <br><br>To the supporters: You guys keep me going. Donations are never required, but for those who have been so generous (over $5), I'm now offering custom-designed backgrounds for any device as a small token of my gratitude. I want to give back to those who help keep this ship afloat.<br><br>So Thank you to for going above : will cut the usernames you Should know who you are tho :) thank you again.<br>Rafa.. , CAPSxXx.... , Prime... , Dekoy... , Pip , Craig, Zeod , Newts...... , Jayr.. , FussyRu... , Fiks.. , Palli.... , Kalah , CoryAka..... , Matt . <br><br>everyone else again thank you as well</div></details><br> Thank you for taking the time to read this. If you felt I wasted your time, I apologize. However, if any of you are going through your own battles—health or otherwise—and need to vent, my DMs on Discord/Twitter are always open. We are all fighting something, and I am here for you guys just as much as you are there for me."
},  
{
"id": "Thanks Gamers",    
"active": false, 
"lastUpdateText": "Cant Thank You Gamers Enough 🫂🤗",
"buttonDate": "11/30/2025 - 4:10 pm EST",
"messageTitle": "Cant express how much this has helped, done for me like wow",
"messageContent": "<b>Thanks everyone</b><br><br>I cant thank you gamers enough below is health update, an li bit of info on what I have... expand or check older post below.<br><details><summary>health update ish</summary><div style='color: darkred;'><b>Thanks again everyone</b><br><br>I cant thank you gamers enough for understanding one thing.. I am open about it, I have lupus APS + Vasculitis + Other health issues, I have good and bad days and certain times of the year I get sick worse and end up in the hospital cause of how bad I am spitting up blood or cause they have to up my meds again to massive amount until I can get my treatment<br>Or I have days where hands/arms/legs/feet are swollen and just hurt to move/use... this shit I have is the worse.<br>Treatments are every 5/6 months which again is not fun 6/8hours for treatment via IV fucking sucks, So again if Im not at the hospital/appointments/treatments I will always try and update info within the hour of being posted/updated, If at something I will update once home, So thanks for understanding that gamers<br><br>I am still banned on reddit which sucks so i know peeps over there are posting codes right when they do or few hours after as some of you still use this reddit.. so again 99% of times i am faster then all.<br><br>Thanks again for you gamers who donated, some of you did the 5$ and some of you did 30/50$. Again was never a thing needed to do or have to but the few dono's have helped me alot<br>(check kofi dm's gamer who did bigger got a dm for a custom background gift from me)<br>Reason Is I got a 9 year old lil girl so been able to get her some gifts cause of you gamers<br>Thanks again for the few of you who was able to support this site/work I have done<br>(hating peeps just stop I didnt make millions smh.. made a few dollars, stop hating on a free thing)<br><br><br><s><b>Hey everyone,</b><br><br>Some of you know, I have list of health issues and today you can proly guess where I was.. back home now so will be updating blackmarket stuff sorry for the delay :(</s></div></details><br>The reason I am posting this today.. Is again to thank you all.. for the 5$ and gamers who went 30/40/50$ its not about the money but it has helped me be able to get some things for my daughter. I suffer from health issues/mh issue an other things and cause of it cant work.. so this lil bit of extra money will help with getting gifts/other items  an such. I proly should not be sharing this but, I got dealt a shit hand as you gamers can see and you gave me joy and happiness.. I love that you gamers love what I have done here and will Keep doing it.. even with a hour or two delay on updating codes or bm info.<br><br> Just means alot, Dono's have slowed down and know some think I plan to end this project I don't plan on it. I use it, you use it, friends and fam use it.. So its staying.. I love bl4 even with the bugs and flaws and randys random but stupid tweets lol I will keep bringing updates an new codes here... As long as you gamers keep using it <br><br> For you gamers who did donate above the default one 🍵, plz plz plz check kofi dm's as wallpaper info is needed."
},  
                {
"id": "Health Ish, Sorry for late update",    
"active": false, 
"lastUpdateText": "health ish sucks",
"buttonDate": "11/21/2025 - 9:53 am EST",
"messageTitle": "Sorry and thanks for understanding, and also helping [sorry if below is hard to read]",
"messageContent": "<b>Thanks again everyone</b><br><br>I cant thank you guys enough for understanding one thing.. I am open about it, I have lupus APS + Vasculitis + Other health issues, I have good and bad days and certain times of the year I get sick worse and end up in the hospital cause of how bad I am spitting up blood or cause they have to up my meds again to massive amount until I can get my treatment<br>Or I have days where hands/arms/legs/feet are swollen and just hurt to move/use... this shit I have is the worse.<br>Treatments are every 5/6 months which again is not fun 6/8hours for treatment via IV fucking sucks, So again if Im not at the hospital/appointments/treatments I will always try and update info within the hour of being posted/updated, If at something I will update once home, So thanks for understanding that gamers<br><br>I am still banned on reddit which sucks so i know peeps over there are posting codes right when they do or few hours after as some of you still use this reddit.. so again 99% of times i am faster then all.<br><br>Thanks again for you guys who donated, some of you did the 5$ and some of you did 30/50$. Again was never a thing needed to do or have to but the few dono's have helped me alot<br>(check kofi dm's guys who did bigger got a dm for a custom background gift from me)<br>Reason Is I got a 9 year old lil girl so been able to get her some gifts cause of you guys<br>Thanks again for the few of you who was able to support this site/work I have done<br>(hating peeps just stop I didnt make millions smh.. made a few dollars, stop hating on a free thing)<br><br><br><s><b>Hey everyone,</b><br><br>Some of you know, I have list of health issues and today you can proly guess where I was.. back home now so will be updating blackmarket stuff sorry for the delay :(</s>"
},
        {
"id": "Reddit ish....",    
"active": false, 
"lastUpdateText": "Reddit WTF",
"buttonDate": "11/11/2025 - 10:12 pm EST",
"messageTitle": "All for trying to help like smfh",
"messageContent": "<b>Hey everyone,</b><br><br>So I am now shadow banned on reddit, all post removed... even the post about the site which so many did post and comment on.. cause reddit says account was spamming like wtf... I was posting codes to 2 borderlands subbits and one I made, I don't get why when I try an do something good like posting for months like i have been each time he post codes.. and that NOW all of a sudden now.... this shit is happening... like almost 250k or 300k views this thing had https://www.reddit.com/r/Borderlands/comments/1npcmrf/shift_code_tracker/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button and now look like wtf reddit <br><br> plz now more then ever share the site, tell ya friends/family an others.. cause main source for peeps knowning is now fucking gone cause of reddit...<br><br>Thumbs up : if think its bs<br>Thumbs down : if you agree should be kept banned"
},
    {
"id": "Sorry About This.....",    
"active": false, 
"lastUpdateText": "Haters An Trolls",
"buttonDate": "11/7/2025 - 11:13 am EST",
"messageTitle": "Things might be broken, working on it",
"messageContent": "<b>Hey everyone,</b><br><br>So, I woke up to someone troll/dipshit which what they did harms no one, just annoying on my end... they looked at the code found the webhooks urls, where the sending codes/polls/feedback and such go to... an spammed discord links, hate msg, an just troll/hater type shit... with that again its not a big deal just annoying to purge and clear... So I didnt want to but the repo is now private and page is still public.<br><br><b>Had to pay for pro account</b><br>It sucks i had to do this, as any other way would change the url, breaking the site url you all know.. So haters/trolls screw you, cant spam the webhook urls now.. cause they all got redone and old ones deleted and out money cause of you so thanks.. thinking your cool/funny again your not and its lame what you did again hating on this so much to waste your time for a few mins of enjoyment smfh<br><br><b>So I am relinking things and checking things</b><br> Contact me on discord if something is really broke or use right report buttons plz."
},
  {
"id": "HMM.....",    
"active": false, 
"lastUpdateText": "HMM.....",
"buttonDate": "11/3/2025 - 2:30 pm EST",
"messageTitle": "A Note on Recent Changes and Moving Forward",
"messageContent": "<b>Hey everyone,</b><br><br>I'm writing this today to talk about the recent updates and the feedback I have received. I'm always striving to improve your experience, and a big part of that is listening to what you have to say. Many of the recent changes were direct results of polls and feedback from you, the community. My goal was to implement the features that you asked for, and I was excited to bring them to life.<br><br>However, alongside the positive and constructive feedback, there has been a significant amount of negativity and hate. This has come through in reports, the feedback button, and even direct messages on Discord and Reddit. To be clear, I'm not talking about constructive criticism – that's always welcome. I'm referring to hateful, non-constructive, and frankly, abusive comments. This has been disheartening, to say the least.<br><i>Sad people can be so hateful/bashful again on a free project/site that allows you to track/hide redeemed things...some of you even hate me making post like this... like man, Am sorry for making post like this, but hopefully it would change haters into lovers as they can see the reason for things is feedback/votes and NOT JUST THEM, as many use the site not just them.</i><br><br>The passion of this community is one of its greatest strengths, but the toxicity of a vocal minority can be incredibly damaging. It's especially frustrating when the changes being attacked are the very same ones the community voted for.<br><br>In response to the mixed feedback, and in an effort to give everyone more control over their experience, I've spent a considerable amount of time and effort implementing a range of new options. I honestly had no idea how much time this would take, but I felt it was important to provide a solution that works for everyone.<br><br>There are now <i><b>seven different options</i></b> that allow you to hide or change the new features. If you're not a fan of some of the recent updates, you can simply open the <i><b>⚙️ GEAR button in the corner</i></b> and customize your experience to your liking. This way, those who want the new features can enjoy them, and those who don't can opt-out of seeing them.<br><i>So stop with the to many buttons, its to ugly and so on HIDE STUFF or use diff layouts</i><br><br>I want to extend a huge thank you to everyone who has been supportive and has provided constructive feedback. Your messages of encouragement and thoughtful suggestions are what keep me going. You are the heart of this community, and I truly appreciate you.<br><br>For those who continue to send hateful messages, I urge you to reconsider your approach, Or just stop using this site. This project is a labor of love, and while I'm more than happy to listen to your concerns, I will not tolerate abuse, cause you fail to use options to hide/change layouts.. Or cause people want to support via tips/donations.<br><br>Moving forward, I'll continue to listen to your feedback and make improvements. Please continue to share your thoughts through the proper channels, but let's keep the conversation respectful and constructive. Let's work together to make this a positive and welcoming community for everyone.<br><br><i>Thank you for your understanding and reading this, If can support would mean alot, as said above had no clue how much time would be spent on this updating/changing/fixing/redoing codes an more thank you</i>"
},
{
"id": "📹Speaking On The Site, Hate, Options An More",  
"active": false, 
"lastUpdateText": "📹Speaking On The Site, Hate, Options An More",
"buttonDate": "10/25/2025 - 2:30 pm EST",
"messageTitle": "Proly should not of done this lol",
"messageContent": "Made a review vid but also talk about few things that I hate and some bs but mostly a review of diff things and why things got added and and talk about buttons you gamers might not even know about<br><br>Cause it seems many of you dont <i>Refresh</i><br><br><b>how do I know this?</b> <i>cause you guys send me in codes that have been added for days/or got added the second they was posted... PLZ ALWAYS REFRESH</i>",
"imageUrl": "https://www.youtube.com/embed/6OfsvCjlsvs?si=lxEhUgqaAVN7HPQF"
},
{
"id": "🫂🤗 Love, An Hate 🤬",  
"active": false,
  "lastUpdateText": "🫂🤗 Love, An Hate 🤬",
  "buttonDate": "10/20/2025 - 5:33 am EST",
  "messageTitle": "The Good, The Bad (this will be used as a live update/msg to you all :) ",
  "messageContent": "So the post I did yesterday still stands, thank you gamers.. still getting, nvm it don't matter i cant win smfh...7layouts + fixes still getting slammed... codes should be on top buttons at bottom and on front page.. they are on front (enable codes only mode/hide ish options) to remove them button.. like holy at this point I don't know what to do to..<details>\n  <summary><i>Did this post around 5pm on 10/19/2025 explains some things (click to expand)</i></summary>\n  <p>Vault Hunter, Again just want to thank you all, for being damn epic and showing love, via msgs/post/input buttons... again means alot reading all the love not going to lie was heart warming and made my day...<br><br> I know to focus on haters I should not do but I dunno I wanna make everyone happen even them.. hence me having the post about Multi Pc/Mobile layouts and Updated Hide options/Layout (spending time adding them and even redoing mobile stuff and also fixing the modal windows) ... and wanted to also let them know the dono is not going anywhere.. and that yes sometimes codes might be a hour or few hours late...<br><br> I have a life, Kid, An Health issues where I have ups and downs or sometimes multiple appointments in a week/treatments every few months.. so I will always try and update the codes as soon as i get wind of them or see them, but you will always have days to redeem them as i will never add a code that will expire a hour later or be that late. <br><br>Sorry for the long read.. I feel i should of been more professional and thats why the old msg is gone and went this way as well..sorry for you all having to read that.. just hate getting hate when just want to help bl gamers <br><br> Haters, I i took your hate and in return added and changed things so before keeping it going check out the options/new buttons an things before you think about sending the hate.. Not going to lie some of you had me thinking twice.</p>\n</details>"
}
]
